aaa
aaaaa
aaaaaa
aaaaah
aaho
abatoara
abatoira
abel
abondonnes
about
above
abri
absences
accompagne
accordant
accueillent
adailana
adalaina
adalako
adalam
adalan
adalana
adalanao
adalany
adaldalanao
adama
adamalandy
adi
adiady
adidiko
adidin
adim
adino
adinoanao
adinodino
adinodinonao
adinohy
adinoiko
adinoina
adinoko
adinon
adinonano
adinonao
adinony
adinoy
adintsika
adiresy
adisoana
adisoanao
aditrana
admirais
adore
adray
adresser
adrisa
afafin
afak
afak'hidinika
afako
afaky
afara
afarako
afatsy
afeniko
afer
afera
aferafera
aferan
afin
afindrafindrao
afoavoan
afobe
afobeny
afoinao
afokasoka
afolakao
afomololo
africains
afrika
against
agn'olo
agnano
agnilan
agny
agonisent
aha
ahafa
ahafahako
ahafaly
ahafantatra
ahafoy
ahaizako
ahakivy
ahalala
ahalalana
ahaloa
ahamasaka
ahanfantarana
aharaka
aharitra
ahasalama
ahasambatra
ahasoa
ahatamana
ahatoky
ahatsapàny
ahatsiahy
ahatsiaro
ahatsiarovako
ahatsiarovan
ahatsiarovanao
ahavery
ahavoa
ahavozona
ahay
ahazaka
ahazo
ahazoan
ahefa
ahetriny
ahiahinao
ahiako
ahiany
ahindrahindrao
ahinjiro
ahiratra
ahita
ahitam
ahitanao
ahoako
ahoan
ahoanareo
ahoany
ahona
ahondrany
ahoriana
ahovoka
ahyi
aia
aidiro
aigre
aiky
aime
aimes
aimions
aimons
ainga
aingam
aingana
aingao
aingintraingitra
ainsi
aise
aises
aizan
aizim
aizina
ajanony
ajouter
aka
akaikin
akalan
akama
akamako
akamanay
akamany
akanga
akaniko
akanin
akanintsika
akaso
akatonareo
akatony
aki
akia
akimpio
akin
akipio
akiviako
ako
akom
akombony
akon
akony
akopaka
akoraina
akorandriaka
akorontany
aky
alaelo
alahady
alahelom
alahelon
alahelonao
alahelonay
alahelovako
alahelovana
alaim
alakamisy
alan
alaolana
alarobia
alatrano
alatsinainy
alavaina
alavidavitra
alavitra
alay
album
alea
alehantsika
aleho
aleloia
alentikareo
aleonareo
ali
aligna
aliko
alim
alin
all
allez
allons
aloalo
alofan'ahiahy
alon
along
alors
alou
altara
alterlinks
although
always
am'izay
amalon
amalona
amambolana
amandreniny
amandreny
amantarako
amantsara
ambaboko
ambahikily
ambakan
ambakan'ireo
ambaky
ambala
ambalabahoaka
ambalabamhoaka
ambalambahoaka
ambanidia
ambanilan
ambanilanitra
ambanimbanivohitra
ambanimbany
ambanivolo
ambarambarany
ambarambarao
ambarana
ambaranao
ambaravarana
ambariaka
ambato
ambatofinandrahana
ambavahadin
ambavahady
ambavako
ambeti
ambiansy
ambiaty
ambila
ambimbava
ambin
ambinin
ambinina
ambininao
ambiroa
ambiroanao
ambo
amboakely
ambodiangezoka
ambodiboanara
ambodibonara
ambodimbody
ambodin
ambody
ambohikobaka
ambohimandroso
ambohimena
ambohimiarivo
ambohoka
amboletra
amboloina
ambom
ambompontsika
ambon
ambondrombe
ambondrona
ambongadiny
ambonin
ambonivohitra
ambonongo
amboropotsy
ambozizy
ambozonana
amelao
amen
amerana
amerika
ami
amie
amignagny
amin'anana
amindroana
amis
amitiagny
amitsika
amizany
amizao
amizay
ammbarao
amnjanaka
amo
amoizako
amongoranao
amontana
amorom
amorompatana
amorona
amoronako
amour
amoureux
amours
ampahalalao
ampahory
ampamoizo
ampanajana
ampanantena
ampanataovana
ampandalovana
ampandefero
ampandrana
ampandrio
ampandroso
ampanetre
ampangino
ampango
ampankarina
amparafara
amparibe
ampasana
ampatory
ampelantananao
ampelasoa
ampelatanany
ampi
ampiadiany
ampiampy
ampian
ampianarinareo
ampiandohana
ampiantaina
ampiasiany
ampiasàna
ampifaliana
ampifoha
ampihomehezo
ampijinjana
ampina
ampindramo
ampirafesina
ampiriatiko
ampitaha
ampitahy
ampitainay
ampitony
ampitsonao
ampivarina
ampizara
ampo
ampofoiko
ampofoko
ampoko
ampombo
ampon
amponao
amponga
ampotony
an'alinkisa
an'ambohimiarivo
an'arabe
an'ikaky
anadino
anafarako
anahy
anakavy
anaki
anakiray
analakely
analako
analany
anamafisako
anamalaho
anampy
anan
ananam
ananan
ananana
ananao
ananas
ananay
anantenanay
anantonany
anaovan'ialahy
anarano
anararao
anararaotiny
anataneraka
anatanteraka
anatin
anatinay
anazy
andafin
andakan
andakilasy
andana
andanianao
andaniany
andaohandihy
andapa
andavan
andavandavampako
andefarana
andeferako
andefi
andefimandry
andefomandry
andehanana
andevonao
andevozinao
andinim
andoha
andohako
andohasa
andohasaha
andom
andon
andraindraina
andraisako
andrakandramanao
andrandraiko
andrandraina
andrangotra
andranobe
andrao
andraony
andrasana
andravaka
andray
andrefan
andrerak'aina
andri
andriako
andriamahaleo
andriamanitr
andriamatoa
andriambavilanitra
andriamby
andrianabela
andrianandrainy
andrianiko
andrianinao
andriarimalala
andrikiny
andrimanitra
andrimaso
andrinareo
andrinay
andrisoa
andrnivohitra
androanay
androky
andrompihafiana
andron
androso
androtoko
androtsay
androtsika
androy
anehoko
anelobe
anenenako
anenenanao
angaba
angadin
angah
angahy
angalany
angalao
angalarina
anganha
anganoangano
angaredon
angatahana
angatao
angeh
angezoka
angie
angina
angindina
angivy
angleterre
anglisy
angolampeo
angolanao
angolangola
angolangolako
angolangolanao
angolavaitra
angotinao
angotingoty
angoty
aniiii
anikeheo
anilan
anilanay
anilanilana
aninkeo
anisan
anisy
anjakan
anjanamasina
anjarantsika
anjiana
anjoma
anjomara
anjorom
anjoron
anjra
ankafihizo
ankahalaiko
ankahalany
ankahariana
ankahery
ankalozaiko
ankamamy
ankamaroan
ankamatatra
ankanavaka
ankaninao
ankanjo
ankanjony
ankany
ankaso
ankason
ankason'ity
ankasoparana
ankatakonana
ankazomalaza
ankehitiny
ankehitry
anki
ankibo
ankilabao
ankilizato
ankinafina
ankinina
ankira
ankiroa
ankiteny
ankoatr
ankony
ankory
ankoso
ankosotra
ano
anoako
anolorako
anome
anona
anova
antalaha
antambo
antampon
antanana
antananarivo
antanarivo
antanimora
antanivao
antany
antaontsika
antara
antena
antenainy
anteny
antoandroko
antokotokon
antom
anton'izao
anton'izy
antrano
antratrany
antrnao
antsa
antsaiko
antsaina
antsainao
antsainy
antsaly
antsamotady
antsapika
antsasa
antsasadalany
antsenan'i
antsinan
antsinanan
antsinanana
antsipika
antsirabe
antsiraka
antsitra
antsoantsoko
antsoantsonao
antsoin
antsojay
antsoko
antsokosoko
antson
antson'ireo
antson'izy
antsonao
antsonay
antsonjay
antsony
anxieux
anyeeee
aok
aok'izay
aomby
aona
aondrika
apango
apart
apartheid
apetrako
apetrao
apitrapitrany
apoaka
apololoitranao
apombo
aponga
apotrapotrako
appelait
appelle
approchent
arahaba
arahabaina
arahan
arahana
arahany
arahim
arahin
araiky
araraotina
araraotinao
araraoty
arcades
arendrika
arerahan'ny
arerahana
aretim
ari
ariako
ariary
arides
arina
arinala
aritra
aritro
arms
aro
aroa
arora
arorako
arosoko
around
arovako
arovinai
arovinao
arrangements
arrive
arrivedercci
arriver
arrose
asabotsy
asain
asakasakao
asakasakareo
asakasantsika
asan
asanay
asandratray
asandratro
asandroky
asavoanan
asedra
asetriko
asetrin
asetrinao
asian
asie
asiko
asina
asisika
ask
asolo
asoloko
asongadina
assez
assouvir
atakaloko
atakalonay
atalata
atamberinao
atambo
atamin
atanjaho
atanjao
ataom
ataon'ialahy
ataotao
aterakao
ateriko
ati
atidoha
atoandro
atokako
atokanay
atokona
atolotray
atomboko
aton
atony
atorakao
atoro
atosaho
atosi
atosika
atositokika
atositosika
atositosikao
atours
atouts
atrakao
atrany
atrehany
atrehinao
atreho
atrehonareo
atsapanao
atsembohana
atsimon'iny
atsimotsimo
atsimotsimon
atsinana
atsinanan
atsipinao
atsojay
atsoro
attend
attendent
attendre
attendrons
attends
attirent
attirer
aucun
aucune
augustin
auras
aussi
australie
aut
auteurs
autour
autrefois
autres
autrichienne
auxquels
avadiko
avahana
avais
avako
avalony
avances
avant
avao
avara
avaratrin
avatra
avelaho
avelan
avelo
avelonao
aveo
averimberina
aveu
aviavia
aviko
avily
avin'ny
avinao
avintsika
aviny
avizananao
avocats
avoir
avoko
avokona
avokoooa
avona
avonavon
avonavony
avons
avotr
avoue
away
ayant
ayez
az'ela
azan
azavao
azia
azoako
azoazo
azoazon
azona
azoniko
azotory
baba
babaïque
babeko
babenao
babinao
baby
back
badiko
badobado
bagasy
bagnole
bahia
bahy
baiboly
baies
baikon
baissant
bajajy
bakoly
bal
balade
baliaka
baliha
balika
baliny
bandikelinao
bandikely
bandy
bangoiko
banina
banjinina
banjininao
banni
bantiana
bantsilana
baomba
barabababab
barakay
barara
baravarakely
baravaravana
basin
basy
bat
bateau
bateaux
batita
batravatra
battre
bavan
baventy
bazaha
beau
beaucoup
beauty
beaux
bebenay
bebex
beby
bedaina
bedibedy
bediko
bedin
bedy
been
before
behavior
behind
being
bekoto
bela
belie
believe
belirano
belle
belles
belolo
belong
belongs
bemolanga
benandro
benja
beranto
bercerai
bero
bery
besalampy
besarety
beside
besoin
bessa
best
betsak
better
bianco
biavy
bidy
bien
bientbt
bijoux
bikana
bilangina
bilarziozy
binany
bis
bise
bisoo
bisous
bitana
bitantsika
bitro
bitsi
bitsik
bitsika
bitsiky
bitsim
blanc
blanche
blanches
bless
bleu
blind
blondes
bmw
boafefina
boahary
boanjo
boary
bobongolo
bocages
bodegany
bodifiakarana
boeni
bofinay
bogosy
bohozonana
bois
boite
bokim
bokon
bokona
bokovoko
bolan
bolangina
bon
bonaika
bongo
bons
bord
boredika
born
borokely
boromanga
borosy
bory
bossa
bosser
botakely
both
boton
botry
bouches
bouteille
bozizy
bozy
bras
break
breaker
bridge
brille
bring
brings
brisant
brisent
british
brosy
brousse
bruit
brume
brunes
build
bulletin
but
bye
bôna
c'est
cabaret
cache
cachera
cadeau
cage
cahier
cajolent
calcutta
calm
camp
cannot
car
care
caressent
caresses
carte
case
cause
ceci
cela
cendres
centime
cesse
ceux
chacun
chacune
chagrin
chambre
change
chanson
chansonnette
chansons
chant
chante
chantent
chanter
chanteurs
chantons
chants
chapeau
chaque
charmant
charmantes
charme
charmeny
charmeuses
chaud
chaudes
chazane
chemin
chemins
chercher
chercherais
cheveux
chez
chicago
children
chips
chorus
chose
choses
chou
château
ciel
ciels
cime
cinquante
clark
close
coco
cocotiers
coda
coeur
coeurs
coin
collier
colliers
come
comes
comme
commets
comoriens
comp
comprendre
congo
continuent
continues
cool
copains
coquette
coquettes
coquillages
coquin
coralmad
corona
corps
cos
could
couleurs
couple
courbettes
couroucouuu
court
cousin
couvrant
crient
cris
crois
cruche
cueilli
cueillir
cuit
cumo
d'accord
d'amour
d'amoureux
d'efa
d'entre
daba
dabiera
dabilio
dadabenay
dadabenoely
dadafara
dadah
dadamanana
dadan
daferana
dafy
dahalo
dahlias
daigner
daka
dakao
dakilasy
dakira
dakolosy
dakozia
dalamby
dalanodiaviko
dalantsara
dalatsara
dam
dama
damasikosy
dames
damosiko
dansait
danse
dansent
danser
danses
danstesyeux
dantony
daona
daravarana
dark
darkness
darknest
darofana
daroka
dason
datsa
davanandro
davarangana
dear
decent
deha
demande
demeure
demoiselles
denis
depth
depuis
despair
dessous
deux
devais
devant
deviendront
devient
devine
devise
devizy
diamanga
diaviano
diavina
diavinao
diavola
diavolan
diavolana
diboky
didi
didn
die
diego
dies
difitra
difo
dify
dignin
dignity
dimbaka
dimbiasan
dimbiasana
dimbiny
dinantsika
dinety
dingana
dinganina
dinidinihana
dinidinintsika
dinidy
dinihinay
diovinao
diplaoma
dirais
dire
direkitera
dis
disadisa
dise
disoina
dispose
disque
distanced
distractions
dit
ditra
ditraditra
ditranao
ditrany
ditrin
ditry
ditsoka
dobodobok
dobohy
dobok
dobok'aponga
doboka
doboky
dodona
dodue
dohan
dokadoka
doko
doladolanao
dolara
domy
don
dona
donak
dondona
donga
dongidongiko
dongidongy
dongontany
dons
doran
dorehitra
doroky
dos
douce
douces
doux
dovia
dovian
down
dradradradraina
dradradradrao
dradraina
drafahalalana
drafanja
drafanjamalala
drafitra
dragnoko
drainivoanjo
drakalakely
drakotra
drala
dralaitelofera
dralavatandroka
dramalagasy
dramanga
drambo
drangolahy
dranomena
dranon
dranon'ando
dranonorana
draozy
draromaso
drasazy
dratovovavy
dravaviantitra
drazananivo
dream
dreamed
dreaming
dreams
drehareha
drema
drendrarendra
drenivohitra
dresena
dresy
dridrangilo
drindrangilo
drodroka
drodroky
droha
dromoromo
drova
dumb
duo
dure
dures
dva
dying
dàlana
each
eaie
eboebo
ect
eee
eeee
eeeee
eeeeee
eeeeeeee
eeeeh
eeh
efako
efalao
efalasanao
efampaka
efanao
effet
efitranoko
eglizy
eia
eiae
eiffeil
eja
eka
eken
ekipanay
ekolazy
elabe
elakelan
elanelan
elantany
elatr
elisa
elle
elles
elo
elohina
elomanga
elonao
embona
embonembona
embrassent
embrasser
emmener
emportant
emprises
enao
enchante
enchantent
encombrent
encore
end
endaho
endless
endrey
endrikendrika
endrin
endry
enfant
enimbolany
enivre
enjana
enjankenjana
enjehany
enjehin
enjika
enjikenjika
enlacent
ennui
ennuie
ennuis
ennuyeux
ensemble
entan
entendez
entends
enti
entitsika
entrain
entretenus
entsaky
envie
envola
envolent
envoyez
era
erikerika
eritreretina
eritrerintsika
erotrerony
eso
esoina
eson
espace
espoir
esprit
est
eta
etam
etc
etoana
etsetra
ety
eurent
europe
eux
eva
even
ever
everyone
everything
evokevo
ewa
excitant
excrucing
expliquer
eyah
eyes
ezahany
ezahiko
f'ao
f'aza
f'efa
f'eto
f'hianarana
f'hisy
f'ho
f'ianao
f'ilaina
f'ilay
f'indray
f'indry
f'izaho
f'izao
f'izay
f'izy
f'olom
f'omeko
f'zaho
faboriana
fadin
fafafafao
fafah
fafana
fafazan
fafazana
fafinaretana
fafàna
fagnahy
fahabanganao
fahabangany
fahadalana
fahafahanao
fahafahany
fahafirin'ny
fahagola
fahaizan'i
fahalalàna
fahalemen
fahamoizana
fahan
fahana
fahanako
fahanginanao
fahanterana
fahantrana
faharariana
fahareseko
faharetanao
fahasahirana
fahasahiranana
fahasambarako
fahasambarana
fahasambaranao
fahasarontam
fahasoavan'ny
fahasoavana
fahasoavanao
fahataperana
fahatarana
fahatsarana
fahatsaràny
fahatsiarovako
fahatsiarovanao
fahatsiarovko
fahatsoranao
fahavalon
fahavaratray
fahavatra
fahavelomana
fahavelona
fahaverezana
fahazakako
fahazarandratsy
fahazavako
fahazavanao
fahazaza
fahazazana
fahendren
fahitalavitra
fahizay
fahombiazana
fahoriam
fahosana
faim
faingana
fainganana
faingàna
faire
fais
faisait
fait
faithfully
faits
fakampanahy
fakan
fakitera
fakiteranay
fala
falafa
falehako
famadihan
famadihana
famafana
famaharana
famaharinana
famangana
famantaranandro
famataranandro
famatarandro
famatorana
famelanao
famenon
famihinao
familafilana
famimdrampo
famindranao
famoizana
fampaherezako
fampiarahana
fampiononanao
fampitaha
fanadinany
fanadinoina
fanafenan
fanafodiko
fanafodin
fanafodinao
fanahiako
fanahin
fanahina
fanahinay
fanahiniana
fanainga
fanala
fanalahidy
fanalan
fanamby
fanamiana
fanamina
fanamparam
fanamperako
fanampianao
fananam
fananan
fananembonana
fanantitray
fanaontsika
fanaperana
fanaraby
fanarenana
fanatitray
fanatitro
fandalovan
fandalovan'i
fandalovana
fandao
fandavana
fandavantena
fandavany
fandemen
fanditra
fandrabirabiana
fandrahonanao
fandraisana
fandrao
fandraofan
fandresen
fandriany
fandrina
fandrindrana
fandàvana
fanefitra
fanekena
fanembonana
fanembonanao
fanenan
fanenjika
fanepaka
fanetrehatena
fanetsana
faneva
fanevan'ny
fangala
fangalam
fangatahim
fangirifirina
faniloko
fanilom
fanilon
fanimbazimbana
fanimpanina
fanina
fanirianao
fanirianay
fanirihako
faniriko
fanirina
fanirinao
faniry
fanitarana
fanja
fanjasoa
fankafanahy
fankahery
fankam
fankampanahy
fankatelemana
fanoitra
fanoratany
fanorisorenana
fanorona
fanovozam
fanovàna
fantam
fantantsika
fantatarao
fantsy
fanànana
faona
faraandro
farahehy
farakely
faran
faranana
farara
fararano
fari
farimbon
farofirofy
fary
fasahianareo
fasambaragna
fata
fatahorana
fataka
fati
fato
fatomatinay
fatoranao
fatoriam
fatram
fatsoratsora
faudra
faut
favy
fay
feel
fefena
fefika
fefinao
feheziko
feheziny
fehin'ny
fehizay
felaniary
femme
femmes
fendrofendonao
fendrofendro
fenitra
fenofeno
fenointsika
fenonao
fentiny
feomanga
feon'angely
feonkira
feotsika
fera
ferais
ferana
ferany
ferapara
fero
ferons
festins
fetin
fetran
feu
feuilles
feux
ffpm
fiadagnana
fiadanan
fiadina
fiafarany
fiaiananao
fiaianao
fiainan
fiainanano
fiainandry
fiainao
fialam
fialofan
fialokalofan
fianakaviamben
fianako
fianam
fianana
fiananao
fianankaviana
fianaranao
fianarantsoa
fianarany
fiandry
fiangarana
fiangaviako
fiangotingotiny
fiantahantako
fiantefa
fiantomboham
fiantsenam
fiantsoako
fiara
fiarafany
fiarahamonina
fiarahan
fiarahana
fiarahanay
fiarahantsik
fiarakely
fiarakodia
fiaran
fiaraovanao
fiaratse
fiarovan'ny
fiasainana
fiasàny
fiatoana
fiatomboam
fiatombohany
fiaviako
fiaviam
fiavin
fibitsikao
fidiany
fidiboky
fidionao
fidoladolanao
fidona
fidy
fier
fierena
fifadikin'ny
fifalianao
fifaliantsika
fifamofoana
fifamonoana
fifampiandaniana
fifampifehezana
fifampitondrana
fifanampiana
fifandrafesana
fifandrafiana
fifankatiavanay
fifanomezan
fifarana
fifidianana
fifohan
fify
fihafarany
fihafiana
fihafihana
fihantahantana
fihantsiana
fiharahana
fiharovan
fihatahantako
fihavanam
fihavanan
fihavananay
fihavian'ilay
fihaviana
fihetsem
fihetsikao
fihetsiko
fiheverako
fihevitra
fihin'ny
fihina
fihiniko
fihinina
fihininao
fihino
fihirako
fihodirana
fihononako
fijeriko
fijoalan
fika
fikalonao
fikaroka
fikekekezany
fikezahana
filafilanao
filahany
filalaovanay
filam
filazako
filazanao
fille
filled
filles
fillette
filou
finday
fine
fines
finganina
fingotra
finiavana
finidim
finidinao
finidy
finir
finonao
fintana
fiononako
fiononam
fiononana
fiontanam
fiovan'ny
fiovana
fiovany
fiovàna
firadaradanao
firafitra
firaisankina
firaisankinantsika
firarintsoa
firavako
firavana
firazànana
firevena
firifiry
firongony
fisainaiko
fisainanay
fisalasalana
fisefosefony
fisehony
fisehosehoana
fiselon
fisiako
fisianao
fisina
fisotroa
fisotron
fit
fitadiavam
fitadiavan
fitadiavana
fitadiavanay
fitady
fitahian
fitahinao
fitaiza
fitaizan'ny
fitaizana
fitakian
fitanisàna
fitantanako
fitaterana
fitavozavozako
fitempon
fitempony
fitepo
fitianavana
fitiava
fitiavantsika
fitivana
fitodiana
fitondram
fitositosiny
fitotototoana
fitovian
fitovianjo
fitrangany
fitrena
fitsaharam
fitsangatsanganana
fitserana
fitsikin
fitsikinao
fiv
fivahiniana
fivarotam
fivavaha
fivavako
fivelomanao
fiverenana
fiverenanao
fivindavindàna
fivoaran
fivondronana
fizahana
fizahoana
fizarazarana
fizotry
flame
flamme
fleur
fleurs
flirter
floara
florissant
flottent
flous
flânant
flânerons
foa
fodiana
fodiany
foentiny
fofom
fohana
fohay
foin
foina
fois
foitra
foka
fokofokon
fokon
fokonolona
fokontany
fola
folak
folak'ianao
folakandro
folaky
folie
folles
fombafomabn
fombafombanao
fomban'ny
fombanao
fombantany
fombany
fomfomba
fon
fonayhanompo
fonenan
fonenantsika
fongariko
fonin
font
fontaine
forever
foronina
fort
forte
fosain
fosaina
fositra
fota
fotoan'izay
fotoanantsika
fotona
fotory
fototr
fotsena
fou
found
fous
fout
frais
fran
franche
francs
fredda
fredonnant
frein
freins
frera
frise
froid
froufrous
fruits
fuient
fuit
fânent
fôana
gaby
gadon'ny
gadraina
gaie
gaigy
galant
game
gar
garantsaka
garde
garnie
gars
gasikara
gasikaraka
gasikarako
gasy
gazety
gejan
gema
generaly
genoux
gens
gentille
gentilles
geocities
geste
gestes
get
gidragidra
gidrangilo
gidro
gilbert
ginagina
girls
gisitra
gitara
gitarany
give
glaïeuls
glou
gn'ady
gne
gny
god
gogo
gohana
gone
gonna
good
goragora
gorina
gorodogorodon'drabefaladia
gosses
got
gotta
goutez
gracieux
grande
grands
gratte
grimpons
grisent
guess
guette
guettent
gueules
guide
gôkagôka
habadoana
habakabak'iny
habbibiana
haben
habibiana
habibina
habitude
hadalainao
hadalan
hadalanao
hadalàna
hadinodinonao
hadinoiko
hadisoako
hadisoana
hadisoanao
hadisoanay
hadisoany
hadisoina
haditra
haditrana
hadrositra
hafahafany
hafaingana
hafalianao
hafalina
hafanan
hafany
hafarako
hafatr
hafatrao
hafatro
hafetseny
hafohy
hafoizako
hafokana
hafokany
haforitra
hafy
hagagana
hahafeno
hahafoana
hahahendry
hahahetsika
hahaizana
hahakanosa
hahalaza
hahaleo
hahamboatra
hahaolom
haharitr'ho
hahasahiako
hahasambatra
hahasaraka
hahasedra
hahasolo
hahatafita
hahatoha
hahatoky
hahatongavanao
hahatsapa
hahavono
hahavonona
hahazaka
hahazoa
hahifika
hahitan
hahitàna
haina
hainay
haintaina
haitraitra
haizimpito
hajaiko
hajainao
hajia
hajoro
hakamoanao
hakamona
hakanton'izato
hakanton'izay
hakantonao
hakantony
hakisaka
hakiviako
hakivina
halady
halaheloko
halakilaky
halalao
halam
halan
halan'andriana
halao
halatrano
halavirana
halavitana
haleloia
halemilemy
halolo
halozàna
hamadiky
hamafamafa
hamafin
hamafisiana
hamafisina
hamaharana
hamaharany
hamakiana
hamalifaliana
hamalifaly
hamamiana
hamamintsika
hamangiako
hamangivangiana
hamangivangy
hamarinp
hamaritra
hambamboako
hambo
hamboko
hambonay
hamborahana
hamboraka
hamburger
hamefy
hameloman
hamenoana
hamenoanao
hametsovetso
hamika
hamikavika
hamiram
hamirampiratra
hamiratr
hamitra
hamitrana
hamofo
hamohamo
hamohifo
hamohifoy
hamolavola
hamololona
hamonia
hamonto
hamoronako
hampadroso
hampanateriko
hampandefero
hampandry
hampanetre
hampangiana
hampatory
hampatsiahy
hampetako
hampiandry
hampiavana
hampidirinao
hampidiro
hampiditr
hampiendreketiko
hampifafifaly
hampifoha
hampihontsona
hampijaliana
hampijalio
hampilamina
hampilentika
hampilofika
hampimalo
hampindraiketiko
hampiondanako
hampirafy
hampiray
hampiredareda
hampirehareha
hampirevy
hampirongatra
hampisotro
hampitaina
hampitebiteby
hampitomany
hampitraka
hampitsetoka
hampitso
hampivarina
hampizara
hampoka
hamporisika
han
hana
hanafana
hanafarako
hanafatra
hanafenako
hanairina
hanaisotra
hanaka
hanakatsakana
hanamafisako
hanamaloka
hanamamo
hanambatra
hanambazana
hanamboarako
hanamboniana
hanamora
hanampahataperana
hanampim
hanampoka
hananam
hananan
hanandrakandrana
hanandram
hananika
hananjara
hanankorotana
hanantona
hanantonany
hanantontosa
hanarenanao
hanasako
hanasy
hanatanja
hanatavy
hanaten'iza
hanaterako
hanatonana
hanatsara
hanavandra
hanavaozako
hanavato
hanche
handadizanao
handahananay
handairam
handamoka
handaniako
handaozako
handaozanay
handaozany
handeferako
handena
handevi
handevintsotrobe
handevintsotsobe
handia
handifitra
handihindihy
handiso
handoalehanao
handondona
handraisako
handrakitra
handramana
handramo
handrandrain
handrandraina
handrandrako
handraok
handraoka
handrato
handravaka
handrehatr
handrehatra
handreseko
handresen
handrombona
handrosoako
handrotsirotsy
handrsy
hanelatra
hanelo
hanembonako
hanempotra
hanenanao
hanenena
hanenenako
hanenenana
hanenenanao
haneo
hanfangaro
hangahiahy
hangaina
hangarika
hangasihasy
hangata
hangatsika
hangirifiry
hangitakitaka
hania
hanihaninao
hanihany
hanilan'ny
hanilikilika
hanilo
hanimbolo
hanindroa
haninkotrana
haninteraka
haniriany
hanirina
hanisanao
hanivatsiva
hanjakako
hanjakan
hanjakana
hanjakanao
hanjakao
hanjokaiky
hanjombon
hankahery
hankaiza
hankalaina
hankalao
hankaleo
hankamamiana
hankarary
hankaroa
hankatsy
hanofisako
hanofy
hanoharana
hanohina
hanohizako
hanoko
hanolatra
hanolokolo
hanolon
hanomanany
hanompy
hanondrahako
hanondrotantsika
hanonja
hanopy
hanoratako
hanoratko
hanoraty
hanorenam
hanori
hanosy
hanoy
hantahantany
hantanao
hantenaina
hantra
hantrany
hantsin'ny
hapariaho
hapoaka
haranitra
harany
harao
haratsian
haratsiana
haravona
harenan
harenantsika
harenao
harenintsika
hareran
haretiko
harindrao
harmonia
harmonieux
haromotana
harora
harorako
haroranao
harry
hary
hasa
hasakasakareo
hasambarako
hasambaranao
hasambarantsy
hasampiko
hasanda
hasaritaka
hasasarana
hasasarany
hasasàrana
hasetriko
hasetry
hasim
hasin'ilay
hasitrana
hasoloko
hasomparan
hasomparana
hasy
hataho
hatakalonao
hatakandro
hatanaorana
hatanjao
hatanorako
hatanorana
hataovy
hatelina
hateloana
hateriko
hateza
hatomotra
hatr
hatraka
hatrakaho
hatrakao
hatram
hatram'isika
hatram'izao
hatram'izay
hatramizao
hatramizay
hatramn
hatrary
hatrehako
hatrehiko
hatrehiny
hatri
hatrin'ny
hatrizao
hatrmin
hatsaharo
hatsara
hatsaraina
hatsarany
hatsarao
hatsembohako
hatsiaro
hatsikana
hatsojay
hava
havahana
havan
havanan
havanja
havaoziko
haverintsika
havesatra
hawai
hawaii
hazakaza
hazavako
hazofijaliako
hazofijalian
hazofijaliana
hear
heard
heart
hearts
heeyy
hefanao
hehiko
helanelan
helo
helohina
henankisoa
henatr
henatrin
henatry
hendratra
hendratrendratra
hendrikao
henika
henoiko
henoina
henri
henry
herana
herany
herbette
here
herezo
herimbaratra
herimpo
herina
heritiana
hetahetako
hetahetam
hetraketrahinao
hetraketraka
hetraketrakao
hetraketraky
hetraky
hetsaketsaketsaka
hetsiketsehiny
heures
heureux
hey
hho
hiafarana
hiafaranay
hiafiana
hiainana
hiainanay
hiainantsika
hiaino
hiakambana
hiakavanana
hiakinana
hialan
hialao
hialofako
hialofana
hialokalofana
hiambo
hiampify
hiampy
hianandrefana
hianao
hianarana
hianareo
hianavatra
hiandrandrako
hiandrasako
hiandrasanao
hiangaliana
hiangaran
hiangarana
hiangaviako
hiangavingavy
hiangotiako
hiangoty
hianjerazera
hiankandrefana
hiankinana
hianoka
hianreo
hiantako
hiantana
hiantefa
hianteherako
hianteherana
hiantrao
hiantsampazana
hiantsena
hiantsinanana
hiantsoako
hiantsonana
hiantsorohana
hiantsy
hiany
hiaona
hiaradia
hiaraha
hiarahabana
hiarahako
hiarahana
hiarakaraka
hiato
hiatrehako
hiatren
hiatsinanana
hiavian
hiavianao
hiavo
hiazakazaka
hibabohana
hibaby
hibahana
hibaliaka
hibata
hibedabeda
hibitaka
hibitsika
hidaroka
hide
hidiany
hidifiana
hidifina
hidiko
hidinika
hidivirana
hidoboky
hidododo
hidola
hidovirana
hiefarana
hiempo
hier
hierana
hierem
hieretako
hieretana
hierika
hierireritra
hiery
hietraketraka
hifaharako
hifaharana
hifamaofao
hifame
hifamelona
hifameno
hifamilafila
hifamisaraka
hifampijerijery
hifampikarakara
hifampilavoatsiary
hifampintantana
hifampisaraka
hifampitady
hifampitaiza
hifampitantana
hifampitondrana
hifampitsetra
hifampitsikera
hifampitsinjo
hifanadino
hifanadrina
hifanaja
hifanakora
hifanalavitra
hifanankonana
hifanantona
hifanapahana
hifanaradia
hifanarahana
hifanary
hifanasoa
hifanatritava
hifandao
hifandrakotra
hifandratra
hifandry
hifanerena
hifangia
hifanila
hifanilihana
hifaninanan
hifaninanana
hifanjohy
hifankafohy
hifankafoy
hifankahalala
hifankahazo
hifankahitana
hifankalao
hifankamamy
hifanodiavana
hifanohana
hifanohanana
hifanohantohana
hifanohy
hifanojo
hifanome
hifanomezan
hifanondro
hifanotofana
hifaranan
hifendrofendro
hiferotr
hifidianana
hifikirana
hifindrany
hifoaka
hifohany
hifohazana
hifohazanao
hifoka
hifona
hifonako
hifongatra
hifosa
higagana
higaka
hihahaka
hihamafy
hihaonako
hihaonana
hihaonantsika
hiharetana
hiharitra
hihatsarako
hihavanana
hihety
hihi
hihiaka
hihihira
hihirahira
hihiratra
hihoaranao
hihodivirana
hiira
hijanonanao
hijoroana
hikalo
hikalokalo
hikambanana
hikentrona
hikiaka
hikiky
hikimpio
hikipiko
hikipy
hikoa
hikodia
hikofoka
hikojakoja
hikolay
hikolokolo
hikopak
hikorisa
hikoro
hikosoka
hikotroka
hilaharana
hilaiso
hilalaovako
hilaminan
hilamona
hilangalanga
hilanona
hilanonana
hilanto
hilaoka
hilaozam
hilaozan
hilaozanao
hilaozankorana
hilaozany
hilavo
hilazanao
hilefa
hilevenam
hilevenana
hilofika
hilofo
hilomanosana
hilona
hilàna
him
himalo
himamoako
himpody
hinanana
hindaosin
hindramiko
hinia
hintsony
hiodikodina
hiolomay
hiomanako
hiombo
hiombona
hiombonako
hiombonantsika
hiome
hiomehezantsika
hiondanana
hiondrana
hiorenan
hiotazako
hiotiana
hiotsaka
hipirina
hipoaka
hipody
hirahiram
hirahiran
hirahiranao
hirahirantsika
hirahirao
hiraika
hiraiko
hirain
hirain'izao
hirain'ny
hiraina
hiraisan
hiraka
hiram
hiramamy
hiran
hiranay
hirantsika
hirarahiram
hirariana
hirava
hiriako
hiriaria
hirifiry
hiriko
hirina
hirinao
hirindra
hiririavantsika
hirongo
hisahirana
hisalasalako
hisalasalana
hisalorana
hisambarako
hisangisangy
hisasarako
hisasatra
hisava
hisavika
hisavorovoro
hisazy
hisedra
hisehoana
hisehoseho
hisendaotra
hisetrasetra
hisintaka
hisitaka
hisitraka
hisoko
hisompatra
hisongadina
hisonia
hisosososo
histoires
hitafa
hitafaka
hitahiry
hitahita
hitaintaina
hitaitaina
hitalao
hitamberina
hitamby
hitan'ireto
hitanintaina
hitanisa
hitantarako
hitarainana
hitazonao
hitetezako
hitia
hitiavanao
hitifiranao
hitodio
hitoeranao
hitoeranay
hitohofako
hitolomana
hitomanimany
hitondray
hitopatopa
hitoraka
hitotorebika
hitraho
hitrakako
hitraotra
hitroatra
hitrotrotrotro
hitsaho
hitsakitsakao
hitsangatsangana
hitsaotra
hitsetsitra
hitsikiana
hitsikiko
hitsiky
hitsilo
hitsin
hitsingidina
hitsinjaka
hitsinjovany
hitsipaka
hitsirara
hitsirian
hitsitsy
hitsodrano
hitsotra
hitàna
hitàvana
hivaha
hivalaketraka
hivalamparana
hivalon
hivalona
hivandravandranao
hivaoka
hivarimbarina
hivavao
hivay
hivazavaza
hivazo
hivazovazo
hivelaranao
hivelezam
hivelomana
hiver
hiverenanao
hiveri
hivetsoako
hivetsoko
hividiano
hiviliana
hivilivily
hivimbina
hivimbinako
hivoaboaka
hivoana
hivoatra
hivolana
hizahozaho
hizarako
hizatra
hizorana
hmm
hmmm
ho'ah
hoa
hoaho
hoahy
hoambinin
hoan
hoan'i
hoana
hoandrandraina
hoanigna
hoanjarako
hoantenaina
hoarahiko
hoasandratro
hoatr
hoatry
hoaviko
hoavin
hoavinay
hoavitsika
hobiana
hobim
hobio
hodiako
hodian
hodiana
hodiavina
hodiko
hodinganina
hodio
hoditrao
hodobasako
hodradradradraina
hoekeny
hoentin
hoento
hoesoriko
hoezahiko
hoezan
hoffman
hofidiana
hofihinina
hofongorana
hofonosinay
hohadinonao
hohadinony
hohaiko
hoheno
hohitanao
hokaloina
hokoloiko
holalaiko
holalovany
holatry
holavitry
hold
holelafinao
holotoiny
hom
homaniko
homankomany
hombako
homban'ny
hombana
homeo
hommages
homme
hommes
honena
honenanao
hong
honohono
honon
honore
honty
hony
hopitalin
hopitaly
horak
horaketiko
horizon
horohoronao
horohorontany
horokoroka
horom
horombe
horompotsy
horonan
hosafosafoiko
hosahirana
hosasatsika
hosena
hosodoko
hosoka
hotadidin
hotafaraka
hotafarina
hotafaverina
hotakotakao
hotanako
hotantanako
hotantananao
hotara
hotataka
hotatanako
hotazako
hotely
hotena
hotia
hotiaviko
hotiavina
hotohizana
hotohizantsika
hotoloran
hotorovana
hotsenain
hotsindriana
hotsindrina
hovakiana
hovao
hovay
hoventesiko
hoverezin
hovidiany
hovimbiniko
hovitako
hovoakina
hovàna
how
hozongozona
htm
html
hum
humm
hummm
hummmm
hummmmm
hurt
huummm
huuumm
iaba
iadanan
iae
iaeee
iafiako
iah
iaho
iainan
iainantsika
iaino
ialofan
ialy
ialàna
iana
ianaaaaaaao
ianaolokanga
iandrasako
iandrasam
iandrasana
iandry
iangaviako
ianihana
iankinako
iankinan
iano
iantsampazana
iantsapazana
iany
iao
iaona
iara
iaraha
iarahana
iaretana
iaretany
iarivo
iavian
iazy
ibabohana
ibanjinako
idadako
idifina
idivirana
idray
iee
ieee
ieh
ierana
ifaliako
ifaliana
ifalifaliako
ifalio
ifampitondrana
ifandaozanay
ifandimbiasana
ifandrarana
ifanerena
ifanohanana
ifanohizan
ifantohy
ifidianako
ifonako
ifonana
ifonany
igadona
ignore
igny
iha
iha'ny
ihanihana
ihantana
ihanytompo
ihaona
ihaonana
iharaha
ihariako
ihitatra
ihomezana
iii
iiii
iiiii
iindrindra
iindrisy
ijoroana
ikaky
ikala
ikalafanja
ikalakely
ikalaratsy
ikalavavinao
ikambanana
ikendrena
ikimpio
ikitrohan
ikoto
iky
ilaharana
ilakaka
ilan
ilaozako
ilaozan
ilaozanao
ilaozano
ilavoamena
ilaza
illets
illumine
ils
ilàna
image
imaintsoanala
imaso
imasoana
imasonay
imolotrao
imolotro
impirimpiry
importe
importent
incertain
indaosin
indraiandray
indraindraiky
indraindraina
indrindrako
indrindrdra
indroy
indry
ineny
infini
ingahibe
iniako
inianao
injao
injure
inky
inndraindray
ino
inoakao
inon
inside
instant
instr
instru
instrumental
intaony
intentions
interlude
intosny
inty
invitent
iodel
iolahanareo
iombonan
iondanana
iononanao
ipetrapetraka
ipody
ipoirako
ipoka
ipololoran
irainsantsika
iraisam
iraisana
iraraka
irariana
iresaho
irey
iriako
irian
iriana
irianay
iriany
irikoo
irin
iroky
irons
irony
irotra
isainy
isakariva
isalorana
isambarana
isambaravarana
isan'alahady
isanandro
isantarana
isaoranay
isarangotra
isatana
isehoana
isekely
isiaka
island
isotry
isy
itabatabako
itadiavanao
italian
italie
itana
itantarako
itarina
iteny
itmany
ito
itoa
itodihako
itodihana
itodio
itoeram
itoerany
itoetra
itokiana
itomany
itrany
itrimo
itsahiny
itseranao
itsidihako
itsidihana
itsikio
itsiko
itsony
itàna
ivadihana
ivalozana
ivelomana
iverenanao
iverina
ivindavindana
ivoahana
ivoha
ivohitra
ivoho
izahozahoana
izahy
izaitsizy
izan
izanydia
izanyfa
izarako
izarao
izatsy
izeao
iziroa
izny
izorana
izory
j'ai
j'hay
jado
jagobo
jakilinina
jako
jaliko
jaloux
jaly
jamais
jambam
jambany
jambena
jambenan
janahary
janareo
jandiana
jangil
jangobo
jao
jardin
jareo
jasmina
jato
jatony
jatovo
javam
javatiana
javona
jean
jeannot
jefijefy
jehovah
jejo
jejojeo
jengama
jeografia
jeografy
jerenareo
jerijereko
jerijereo
jery
jeso
jesosy
jeune
jeunes
jiaby
jiatry
jinerinao
jinjainao
jiron
johary
joie
jokinao
joko
joli
jolie
jolies
jolis
joma
jomaka
jono
jorery
joridira
joro
joues
jour
jours
joy
joyeux
jusqu
jusqu'au
jusque
just
justin
k'atao
k'aza
k'ilay
k'izaho
kabosy
kado
kafaliana
kafanana
kaikay
kaikerin
kaikitra
kaiska
kajiako
kajiana
kajiko
kajo
kakafotra
kakakaka
kakay
kakerin
kalafefe
kalahelo
kalakelin
kalakely
kalalandy
kalasoa
kaliko
kalo
kaloiko
kaloin
kaloina
kalokalo
kaloko
kalom
kalony
kaloy
kalvary
kaly
kam
kamory
kanaly
kanampy
kanatrika
kandra
kandrina
kandrinao
kanton
kantotsika
kaoatry
kaontin
kaonty
kapain
kapila
karaborosy
karajia
karakaran
karana
karanao
karehefa
kasasarana
kaska
kat
katraka
katry
katsahin
katsahinao
kava
kavana
kavandra
keep
keliko
kendrena
kendri
keniheny
kentrona
kepaka
ketrika
ketsa
kevoka
kiady
kiafy
kiakan
kialao
kianjan'ny
kiasy
kibobo
kidadadada
kidaladala
kidaombaramita
kidoro
kijery
kijoro
kilabao
kilalaon
kilalaonao
kilasy
kile
kilemany
kilonga
kilongan
kily
kinanga
kinanjo
kinasa
kinasantsika
kindrindriana
kintan
kintankely
kiondànana
kirantsika
kiraronao
kiray
kiriana
kirikiriana
kirin
kirina
kirisimasy
kirizy
kisa
kisedra
kisendrasendra
kitakita
kitanitany
kitarainana
kiteniteny
kitokiana
kitomany
kitoza
kitroka
kivadivady
kivarivary
kix
knees
know
knows
koatra
kobaka
kobam
kobonina
kodia
kodiavina
koditrao
kokokoloina
kolaka
koloina
kolokolo
kolokoloiko
kolokoloy
kolona
kolontsaina
koloy
koly
kombana
kong
konjo
konka
kopahin
korana
korazy
korkoragna
korontan
kororohinao
kotaba
koto
kotrehinao
kotro
kotsa
kotsakotsa
kotsan
kpoa
krismasy
l'abandonne
l'amour
l'ancien
l'asa
l'aventure
l'esprit
l'un
l'usine
l'âme
laaaa
labodiky
ladiresy
lafika
lafiratsiny
lagaly
lah
laha
lahaly
lahatr
lahatsoratra
lahina
lailailaiouu
lailaiouuuu
laingalainga
laissant
laisse
laissent
laisser
lait
laitrako
laitram
laitran
laizina
laka
lakam
lakanao
lakantsika
lakilasy
lakozia
lalaiko
lalaina
lalalalala
lalalalalala
lalam
lalandava
lalandavitra
lalantsika
lalaon
lalatiana
lalim
lalitr
lalodalovana
lalovako
lalovan
lalovana
lalovanao
lalovy
lamako
lamaody
lambahoany
lambako
lambamena
lamban'akoho
lambanao
lanadanaka
lanaka
lanao
langalanganao
langolangoinao
langoraona
langoraony
laniana
lanianareo
lanitr
lanjako
lanjalanjao
lanjan
lanlandava
lanonana
lanto
lao
laoka
laokan
laonin
lapan
lapasoa
large
larivo
laroina
las
lasaizahay
lasalasa
lasan
lasana
lasary
lassent
latsaina
latsak
latsalatsa
latsam
latsan'i
latsy
laure
lavabe
lavareny
lavi
laviko
lavin
lavitrisa
lazain
lazalazao
lazoin
lead
leave
lefin'ny
lefitro
lehiretsy
lehitahy
leirony
leiry
leisy
leitsy
lenan
lendemains
lendrema
lenina
lenta
leon
leony
lepaly
ler
lera
lerony
lery
leson
lesy
let
letinako
letnbe
letsy
leur
leurs
levana
levelo
levenam
levilevinao
levilevy
levony
lie
lieu
life
light
like
lila
lima
lirai
lisaka
lit
litatra
litorzia
litsa
little
living
loakan
lobolobo
lohamboto
lohateny
lohatoana
lohatoandro
loin
lointain
lokaloka
lokalokan
lokomena
lokon
lola
lolo
lolom
lolona
lomorina
london
long
longoko
longs
longtemps
lonilony
lonjonin
lonjony
lony
looking
lop
lord
lorsqu
lorsque
lotoina
lotoiny
loton'ny
loups
lourd
lourde
lovasoa
love
lovia
lovings
lozan'ilay
lozanareo
luc
lucien
lui
lys
làka
làlana
làlantsika
lànaka
lôtra
lùta
m'en
m'ennuie
maba
mad
madagasigara
madagasikara
madama
mademoiselle
madinidinika
madirovalo
madisadisan
madiva
mafaitra
mafandri
mafilopilotra
mafinaritra
magadasikara
magalahala
magic
magnangy
mahababo
mahabe
mahabo
mahafanina
mahafapo
mahafaritra
mahafohy
mahahontsa
mahaketraka
mahalankalana
mahalasana
mahaleo
mahaleotena
mahaleova
maham
mahamaika
mahana
mahantamana
mahaofa
mahaontsa
mahaory
mahaosaosa
maharaka
mahararirary
maharary
maharatsy
maharena
mahari
maharin
mahasahy
mahasara
mahasaraka
mahasarika
mahasaro
mahasolo
mahasondriana
mahasorena
mahasoso
mahatafahoatra
mahatafita
mahataitra
mahatara
mahatata
mahate
mahatelikanina
mahatofoka
mahatokana
mahatokona
mahatoky
mahatombon
mahatombona
mahatsiahy
mahatsikaiky
mahavaka
mahavalalanina
mahavatra
mahavery
mahavirjiny
mahavitra
mahazaho
mahazendana
maherihery
maherinay
mahitahita
mahitsin
mahitsiny
maholia
mahonena
mahontsa
mail
main
mains
maintimainty
maintimalaly
maintin
mainto
maintso
mais
maison
maivandoha
maizi
maizimbe
majunga
makadilo
makamamy
make
makeny
makes
makiana
mal
malabary
malaelo
malagasy
malagasyrainb
malaimbady
malakilaky
malaky
malasana
malefadefaka
malefolefo
maleova
malgache
malia
malok
malotoloto
malsaines
mam
mama
mamaindra
mamalia
mamalivaly
maman
mamanala
mamandrim
mamarara
mamasera
mamay
mamazivazy
mamba
mambotry
mamefy
mamelively
mamelombelon
mamelombelon'aina
mamelon
mamelovelo
mamendrofendro
mamera
mamery
mametak'etikety
mametsovetso
mamikavika
mamiko
mamilafila
mamimamy
mamin
maminao
mamindro
mamintsika
mamintsinka
maminy
mamirifiry
mamiry
mamofompofon
mamohafoha
mamoifo
mamokatse
mamolava
mamololona
mamom
mamonomono
mamonto
mamoron
mampahazo
mampahonena
mampamoy
mampanahiahy
mampanao
mampandeha
mampanembona
mampangaihay
mampanganohano
mampangidihidy
mampangoraka
mampangovitra
mampanjakazaka
mampanjelatra
mampanjombona
mampanoina
mamparoroka
mampatory
mampatsiahy
mampi
mampiafana
mampiahiahy
mampiara
mampibontsin'orona
mampidanadana
mampidera
mampidingin
mampientana
mampifanditra
mampifandrafy
mampifandray
mampifelana
mampiferinaina
mampifezaka
mampifila
mampifilafila
mampifoha
mampihenahena
mampihira
mampihodina
mampihomehy
mampihonjona
mampijafajafa
mampikoriana
mampilalao
mampilamindamina
mampilendalenda
mampilomay
mampiorona
mampiparitaka
mampirafy
mampiray
mampisala
mampisampana
mampisara
mampisento
mampitalaho
mampitambatra
mampitamby
mampitanondrika
mampitaraina
mampitempo
mampitohy
mampitoloko
mampitomany
mampitotototo
mampitsangam
mampivadika
mampivandravandra
mampivaralila
mampivezivezy
mampizarazara
mampody
man
manabatibaty
manabe
manadalo
manafana
manafatra
manafo
manafody
manafosafo
managasanga
manahiragna
manakara
manakoako
manakona
manakora
manakotaba
manal
manal'azy
manalazy
manaloka
manamaloka
manamando
manamasaka
manambitamby
manambola
manambotra
manampetra
manan'hery
manan'olona
mananatena
mananatranatra
manandaza
manandrama
manangasanga
manangatra
manangoly
manangon
mananiany
mananjiana
mananjina
manankamban
manankavaly
manankery
manantandrify
manantantara
manantona
manantsiny
manaradia
manarah
manarangarana
manaratara
manarin
manasofaso
manatena
manavao
manavinavy
manavy
mandadilady
mandahatra
mandambolambo
mandamigna
mandamoka
mandarakizay
mandatsalatsa
mandavan
mandavataona
mandetika
mandia
mandialaza
mandihalaza
mandina
mandindona
manditsoka
mandodona
mandoko
mandom
mandona
mandondom
mandondona
mandondondondona
mandongilongy
mandositr
mandraiky
mandraisa
mandrak'androany
mandrak'izao
mandrak'izay
mandrakzay
mandram
mandrama
mandrangitra
mandrapaha
mandrapi
mandrapihaona
mandrapikipy
mandrefirefy
mandria
mandrifotsy
mandrindra
mandringa
mandrirotra
mandritsoka
mandroroa
mandrorondrorona
mandrosonoro
mandrotika
mandrotsirotsy
mandéana
manebaka
manefe
manelontselona
manembona
manembonembona
manempotra
manendrika
maneninenina
manenjan
manenoa
manentsin
manerikerika
manesika
manetsika
maneva
mangahiahy
mangaihay
mangaina
mangala
mangamanga
manganoano
manganohano
mangarika
mangaro
mangasihasy
mangasoavina
mangata
mangatsiahitsiaha
mangatsiatsiaha
mangatsika
mangatsohatso
mangiana
mangidihidy
manginan
manginan'ireo
mangirifiry
mangitakitaka
mangorangorana
mangotrangotraka
mangotsoka
mangovingovitra
maniasia
manigna
manigne
manimanin
manimanitra
manin
manina
manindrahindra
manindroa
maniratra
manirikiry
manish
manivaka
manivatsiva
manj
manja
manjamanja
manjaray
manjeny
manjera
manjohizohy
manjohy
manjombon
manjombonjombona
manjopiaka
manjoretra
mankadilo
mankafyararaoty
mankalao
mankararirary
mankasiaka
mankasitra
mankato
mankatoa
mankaty
mankery
manky
manodiava
manody
manofahofa
manofisa
manohantohan
manohatra
manoina
manoko
manolatra
manomban
manombatrombatra
manondrana
manongo
manorata
manoritra
manosika
manotany
mantasoa
manteau
many
maona
maotimaoty
maoty
mapifandray
mapitotototo
maracas
maraindray
maranitsa
mararirary
maray
marcha
marchons
mare
mare'ty
maredon
mareforefo
maregna
maregny
marguerites
mari
mariages
mariazy
marigna
marik
marikik
marimaritra
marin
marisarisa
maritra
maritrafo
marobe
marofy
marovoay
married
mas
masera
masika
masikita
masimasinin
masinina
masoanao
masoandra
masoandroko
masoandrom
masoandronay
masombika
masotsika
mataho
matahotr
matamagna
matatesa
matesa
mateti
matetik
matetitetika
mateza
maths
mati
matim
matimatinao
matimbola
matinkambo
matokisa
matoy
matso
mavana
mavany
maventy
mavesatr
mavitribitrika
mavokely
mavomavo
mazana
mazia
mazàna
mbamin
mbay
mboux
mby
mehezana
meilleure
menafify
menakely
menamenatr
menamenatra
menao
menomenona
menomenonao
merika
merveille
merveilles
merveilleux
mery
mes
mesdames
messieurs
met
metez
metimety
metisy
mettant
mettez
mettre
meurent
meva
mexico
miadiady
miafinafina
miafy
miahotra
miaingaainga
miaingitra
miaingna
miakina
mialangalana
mialatsiny
mialoalo
mialon
miambakavaka
miambatrambatra
miambo
mian
miandoha
miandrivazo
miandàkana
miangaly
miangotingoty
miangoty
mianjona
miankanakana
miankanjo
miankara
miankin
mianotra
miantefa
miantomboka
miantona
miantraika
miantsampy
miaradia
miaramifaly
miarihary
miarina
miataka
miatomboka
miavom
miavona
miazakazaka
miazina
mibaby
mibadabada
mibakabaka
mibalady
mibaraka
mibatabitaka
mibedibedy
mibedy
mibipy
mibireigna
mibitabitaka
miboika
miboredika
mibosesika
micomplet
midanaka
midangana
midaty
mideza
midim
midingina
midiridiry
midodododo
midofaka
midola
midongy
mie
mielina
mielo
mieloelo
mientana
miepaka
miepakepaka
miera
mierika
mierikerika
miery
mietsiketsika
mieux
mievitra
mifahantotra
mifamaho
mifamahofaho
mifamatotra
mifamazivazy
mifambabo
mifameno
mifamolaka
mifampahery
mifampiandry
mifampiantso
mifampiantsoantso
mifampihaino
mifampihavana
mifampikarakara
mifampindrana
mifampintantana
mifampisafosafo
mifampitady
mifampitantana
mifampiteniteny
mifampitsinjo
mifampivelirano
mifanahaka
mifanaiky
mifanaja
mifanalika
mifanampia
mifanandrina
mifanao
mifanary
mifanasoava
mifanavazana
mifanavotra
mifanazava
mifandako
mifandamina
mifandao
mifandraitamita
mifandraka
mifandrakotra
mifandrebireby
mifangaoharo
mifangia
mifangoa
mifaningotra
mifanjohy
mifankafantatra
mifankafoy
mifankahala
mifankahalala
mifankalala
mifankat
mifankato
mifankatoa
mifanohana
mifanohotra
mifanojo
mifanolotra
mifanompo
mifendrofeendro
mifendrofendro
miferin
mifilofilo
mifody
mifoko
mifosa
migadragadra
migafy
migaigaina
migaina
migidra
miha
mihabe
mihadonto
mihafahafa
mihafotsy
mihahaka
mihalavo
mihamafy
mihamainty
mihamaivana
mihamaizin
mihamaizina
mihamaloka
mihamangovitra
mihamatotra
mihamatromatroka
mihamaty
mihambahamba
mihambohambo
mihamena
mihanahana
mihani
mihanika
mihantra
mihantsin
mihaotra
mihararetra
miharingitra
miharitra
mihasarotra
mihatakona
mihato
mihatsara
mihelohelo
mihenahena
miherikerika
miherina
mihetraketraka
mihevera
mihezaka
mihifaly
mihilangilana
mihinam
mihinanm
mihintsina
mihintsy
mihisakisaha
mihisakisaka
mihisatra
mihitatra
mihizihizy
mihoava
mihodikodina
mihofo
mihoko
mihomana
mihomeheza
mihonona
mihontsona
mihosona
mihovitrovitra
miila
miisa
miisy
mijafajafa
mijaiko
mijerijery
mijohy
mijojo
mika
mikabary
mikaikaika
mikakatsaka
mikalo
mikalokalo
mikaravasy
mikarokaroka
mikasia
mikata
mikavivia
mikenokenona
miketrona
mikiaka
mikija
mikimpy
mikipy
mikiriza
mikisina
mikitrona
mikoa
mikobana
mikodia
mikolo
mikopa
mikorana
mikororosy
mikoràna
mikotroka
milako
milalo
milanto
milay
miledaleda
milefa
milendalenda
milieu
militera
milk
mille
miloaka
miloitra
milolalola
miloloa
miloloha
mimamo
mimonjotra
mimosas
mimoza
mimpololotra
min'ny
mine
minenineny
mingitrika
miniana
minisitera
minisiterako
minisitra
minitra
mintantana
miodidina
miodina
miolakolana
miolika
miolomay
miomankomana
miombo
miombon
miombona
miomehy
mion
miondakondana
miondraondra
miongotra
mionona
miosom
miotrika
miovitrovitra
miozonozona
mipaika
mipariaka
mipataloha
mipatrapatraka
mipelika
mipenipenina
mipia
mipika
mipitrapitra
mipodiana
mipololotra
mipongatra
mipotrapotraka
mipozy
mirafitra
miraika
miraki
miramiran
miran
mirana
miratra
mirava
miravo
miravoa
mirediredy
mirefarefa
mirent
mirevirevy
miriaria
mirija
mirindra
mirintona
mirintondrintona
mirirotra
miritra
mirobo
mirohirohy
mirona
mirotoroto
mirotsa
mis
misafidy
misafo
misafosafo
misahan
misakaiza
misakeza
misalovalovana
misampatsampana
misangisangy
misangy
misarako
misaramianakavy
misari
misariaka
misarika
misarin
misaveraka
misavorovoro
misehoseho
misesy
misetra
misinda
misintaka
misiteriko
misolelaka
misomaritaka
misomebika
misompatra
misonenika
misosoka
misotrosotro
mistery
mistovy
mita
mitabe
mitadidy
mitafa
mitaha
mitaintaina
mitalao
mitamatama
mitambara
mitamberimberina
mitambezo
mitambolombolana
mitampody
mitampotampona
mitandritandrema
mitanondri
mitantavana
mitarehim
mitavandra
mitavozavoza
mitelin
mitempi
mitempo
mitepo
miteroterona
mitetitety
mitia
mitofatofa
mitofezaka
mitokatoka
mitokatokamonona
mitokona
mitolona
mitomagny
mitomandavana
mitonantonana
mitonia
mitoretra
mitosy
mitotongana
mitototo
mitotototo
mitraa
mitraho
mitrahotraho
mitrandraka
mitratrevatreva
mitrena
mitritra
mitroatra
mitrongy
mitrosa
mitsabo
mitsaha
mitsahara
mitsahitry
mitsaitsaika
mitsakaraka
mitsam
mitsangatsanga
mitsaoka
mitsetra
mitsikera
mitsikia
mitsikitsiky
mitsiky
mitsilania
mitsilany
mitsilo
mitsilopy
mitsindrona
mitsingidina
mitsinjarazara
mitsisy
mitsodrano
mitàna
mivahotra
mivalaketraka
mivalana
mivalo
mivandravandra
mivandy
mivaralila
mivarobarotra
mivazavaza
mivazo
mivela
mivena
miveravera
miverinaato
mivilana
mivindavinda
mivoana
mivoara
mivoatra
mivoha
mivoitra
mivonona
mizarazara
miziriziry
mizora
mizotra
mlvaoka
mmh
mmhh
mmitady
mmm
mmmm
mmmmm
mmmmmmm
mmmmmmmm
mode
moderina
modiamodia
moi
moindre
moins
mois
moiselle
mokondoha
molit
mololoha
moments
momoka
mompera
mon
mopera
moquez
morale
moraramora
morning
moron
morondava
mort
mosara
mosarea
mosaren
mosarenan
moscou
mosika
moskoa
mot
mothers
mots
moue
mourir
mozambika
mozikan'ny
mozikanao
mpahalala
mpahonena
mpakafo
mpakahery
mpamalifaly
mpamangy
mpamosavy
mpampahery
mpanabe
mpanafosafo
mpanakanto
mpanakora
mpanala
mpanamarin
mpanan
mpanana
mpananatranatra
mpanapy
mpanarina
mpanasazy
mpanati
mpanavaka
mpandaingandaigna
mpandindra
mpandray
mpandrinda
mpandrindra
mpandrodana
mpandrotsirotsy
mpangoron
mpaniry
mpanjakan
mpanjakavin'ny
mpanjanaka
mpankafy
mpanolokolo
mpanontany
mpiainam
mpianakavy
mpiangona
mpiantra
mpiantsena
mpiaram
mpiasam
mpibaiko
mpifankatia
mpiha
mpihay
mpihosy
mpijery
mpijokojoko
mpindrana
mpionona
mpiriaria
mpisakaiza
mpisary
mpisolo
mpitana
mpitsena
mpitsiriritra
mpitsok
mpivazo
mpiventy
mponin
mtsam
multimania
murmure
murmurent
music
must
myosotis
màzana
n'ai
n'aime
n'aiza
n'est
n'inon'inona
n'inona
n'iza
nadaboka
nadeha
nadiditra
naditraditra
nadrotsirotsy
nafanafana
nafarako
nafarana
nafonja
nagnambara
nagneky
nahabe
nahafafa
nahafantarany
nahafotsy
nahalagno
nahalasananao
nahaleo
nahaliana
nahaloa
nahamasa
nahandry
nahankiny
nahantonao
naharangahy
naharava
nahary
nahasafotra
nahasorena
nahataitra
nahatamana
nahatombona
nahatoraka
nahatoy
nahatretrika
nahatsapa
nahatsiahy
nahatsiarotsiaro
nahavery
nahazoazo
nahilika
nahilikilika
nahitanao
nahoanay
nahoaona
naika
nailika
nailiko
nainako
naivo
naizanaiza
najokon
nakamban
nakararirary
nakatonao
nakay
nakimpiko
nakipy
nalanao
nalefitrao
naleonao
nalisoa
naloa
nam
namafa
namahy
namaliako
namalianao
namalinao
namanga
namangiako
namantana
namarininao
namasininao
namazivazy
nambakain
nambinin
nambininao
namboatra
namborahako
namelona
namindro
namingana
namingavinga
namirifiry
namisavisa
namitra
namofompofona
namoizako
namoizam
namoizana
nampahoriany
nampandrosoiko
nampanembona
nampaory
namparary
nampiainana
nampiantranoiny
nampiaraka
nampiariky
nampifandray
nampifanerasera
nampifoha
nampijoro
nampikambana
nampikentrona
nampikombona
nampimalo
nampiononinao
nampiorona
nampipetraka
nampiripirina
nampitambatra
nampitapy
nampitaraina
nampitomany
nampitraka
nampivadi
namporisika
nan
nanabe
nanadala
nanadrandraina
nanafatry
nanafiina
nanafin
nanahanatranatra
nanahary
nanahirana
nanairiako
nanakarako
nanakatom
nanalokolo
nanamaizina
nanamarin
nanambatra
nanambitaby
nanambitamby
nanamboarako
nanamborana
nanamboranao
nananihany
nananika
nanano
nanantona
nananty
nanaovan
nanapahan
nanapatra
nanarangarana
nanasina
nanasy
nanavakavaka
nanavesatrra
nandaharan'ilay
nandaho
nandalondalotra
nandalovako
nandalovan
nandamoka
nandaniana
nandaozako
nandeferako
nandehanan'dry
nandehananay
nandingana
nandiniky
nandondona
nandosirany
nandraisanao
nandraky
nandramantsika
nandramany
nandrato
nandratrana
nandrenesam
nandreseko
nandresena
nandrezandreza
nandrian
nandrindra
nandrombona
nandrotika
nandrotindrotika
nandrotsirotsy
nanefay
nanehoanao
nanenenako
naneniky
nangaina
nangala
nangalako
nanganohano
nangarika
nangasihasy
nangatsika
nangenahena
nangiana
nangingina
nangirana
nangirifiry
nangitsy
nangoliana
nangoniko
nanie
nanifika
naniky
nanimbazimbako
nanindroa
nanintan'elatra
nanintona
nanintsan'elatra
nanintsianao
naniriana
nanirina
nanitan
nanitikitika
nanjakanao
nanjoy
nankadiry
nankafiziko
nankafizinao
nankaia
nankalao
nankaminao
nankararirary
nankarary
nankaroa
nankatoa
nankaty
nanoatra
nanoina
nanokona
nanombinana
nanontaniko
nanorana
nanosy
nantenain
nao
naona
naples
narahin'afo
narapany
nararaotiko
naratram
nareo
narian
narindrako
narindranao
narisoa
nasarika
nasesy
nasetriko
nasetrinao
nasolonao
natakalo
natakalonao
natal
natambatro
natentinao
natiora
natobakao
natohy
natombokao
natoniko
natontatonta
natoro
natosi
natosikao
natosim
natositosikao
natositosiny
natrehako
natrizay
natsafaina
natsikiko
natsiro
natsoiko
natte
natural
naty
navadik
navaina
navalon'ny
navelan
naverimberinao
naverinao
navita
navoakan
nay
nazeran
ndao
nday
ndeh
ndehana
ndraindray
ndrao
ndraso
ndray
ndre
ndrematoa
ndreo
ndreto
ndry
need
nefai
neia
nengako
nenibe
neniko
neninao
neninay
neniny
nenitoa
nentanim
nenti
nentim
neny
netin
never
neverina
new
news
nex
nga
ngaha
ngahindriana
ngamba
ngay
ngiahy
ngidin
ngidinao
ngidiny
ngidy
ngodabe
ngolin
ngolin'ny
ngoly
ngoma
ngotingotinao
ngy
nia
niafarany
niafiako
niafiko
niafy
niahaka
niahotra
niainan
niainanareo
niainantsika
nialana
nialàna
nianarany
nianaratsika
niandrasako
niandrasana
niandrasany
niangaran
niangarana
nianjona
nianjonanao
niankin
niankinana
niantefan'ireny
nianteherako
niantomboka
niantranao
niantsa
niantsampitsampy
niantsampy
niantsoko
niaraha
niarahantsika
niarahatsika
niaran
niarenana
niaretana
niaretantsika
niatombohanao
niaviana
niavona
nibaby
nibaliaka
nibanjjina
nibedesana
nidify
nidinanal
nidoboka
nidola
nidrikina
nientana
nierika
nierikerika
nieritreritry
nierotra
nifafy
nifaharako
nifaliana
nifalifaliana
nifamaho
nifamaliana
nifamihina
nifamolaka
nifampierana
nifampita
nifampitantana
