a
aaa
aaaaa
aaaaaa
aaaaah
aaho
aba
abadona
abagta
abaribary
abatoara
abatoira
abavola
abda
abednego
abel
abela
abeza
abi
abia
abiasafa
abiatara
abiba
abida
abiho
abihoda
abimaela
abirama
abisay
abisora
abivy
abondonnes
aborahy
about
above
abraham
abri
abrona
absences
aby
accompagne
accordant
accueillent
acecma
acm
adaboka
adada
adaia
adailana
adakalo
adala
adaladala
adalaina
adalako
adalam
adalan
adalana
adalanao
adalany
adaldalanao
adalia
adama
adamalandy
adami
adara
adbela
adi
adiady
adidiko
adidin
adidinao
adidinay
adidintsika
adidiny
adidy
adihevitra
adihevitrareo
adika
adikany
adiko
adim
adin
adin'i
adin'ireo
adin'izay
adin'ny
adin'olona
adinao
adinareo
adino
adinoanao
adinodino
adinodinonao
adinohy
adinoiko
adinoina
adinoko
adinon
adinonano
adinonao
adinony
adinoy
adintsika
adiny
adiresy
adisoana
adisoanao
aditaima
aditrana
admata
admirais
adolama
adolamita
adolphe
adomima
adona
adonia
adonirama
adoraima
adorama
adore
adramytena
adray
adresser
adrisa
ady
aeliko
aelin'ny
aelinareo
aely
aep
aetrinao
aetriny
aetry
afa
afafazo
afafi
afafin
afafin'ny
afafinao
afafiny
afafy
afahana
afahanao
afahanareo
afahany
afaho
afak
afak'hidinika
afaka
afakampitso
afako
afaky
afangaro
afangaroy
afantohy
afantoka
afara
afarako
afatony
afatory
afatotrao
afatra
afatsy
afd
afeka
afeniko
afenimpenina
afenina
afeninao
afeniny
afeno
afer
afera
aferafera
aferan
aferoko
aferony
afika
afin
afina
afindra
afindrafindrao
afindrao
afm
afo
afoavoan
afobe
afobeny
afohezina
afoiko
afoinao
afoiny
afokasoka
afolakao
afom
afomololo
afon
afon'andriamanitra
afon'i
afon'ilay
afon'ireny
afon'ny
afonareo
afony
afovoan
afovoan'i
afovoan'ilay
afovoan'io
afovoan'ireo
afovoan'ity
afovoan'izy
afovoan'ny
afovoanao
afovoanareo
afovoany
afoy
afr
afra
africa
africafiber
africains
afrika
agabo
agagita
against
agata
agn'olo
agnamba
agnano
agnilan
agny
agonisent
agro
agronomia
ah
aha
ahafa
ahafahako
ahafahan
ahafahan'i
ahafahana
ahafahanao
ahafahantsika
ahafahany
ahafaly
ahafantarako
ahafantaran'ny
ahafantarana
ahafantaranao
ahafantaranareo
ahafantaranay
ahafantarantsika
ahafantatra
ahafatesan'ny
ahafatesana
ahafatesany
ahafoy
ahaizako
ahaizanareo
ahaizantsika
ahaizany
ahakivy
ahalala
ahalalan'andriamanitra
ahalalan'izao
ahalalana
ahalalanareo
ahalalantsika
ahaloa
ahamasaka
ahanfantarana
ahant
ahantony
ahara
aharaka
aharariany
ahariharin'ny
aharihariny
aharihary
aharitra
aharo
ahasahianareo
ahasalama
ahasambatra
ahasoa
ahatamana
ahatazanana
ahaterahana
ahaterahany
ahatoky
ahatongavan'ity
ahatongavan'ny
ahatongavanao
ahatongavanareo
ahatongavanay
ahatongavany
ahatsapàny
ahatsiahy
ahatsiaro
ahatsiarovako
ahatsiarovan
ahatsiarovana
ahatsiarovanao
ahavelomako
ahavery
ahavitako
ahavitan'ny
ahavitanay
ahavitany
ahavoa
ahavozona
ahay
ahazaka
ahazo
ahazoako
ahazoan
ahazoan'ilay
ahazoan'izy
ahazoan'ny
ahazoana
ahazoanao
ahazoanay
ahazoantsika
ahazoany
ahefa
ahemotrao
ahena
ahenoany
ahetriny
ahetsiketseho
ahetsiketsika
ahetsiketsiky
ahi
ahiahinao
ahiahiny
ahiahy
ahiako
ahiama
ahiana
ahiany
ahidrano
ahidranomasina
ahidratsy
ahihoda
ahimana
ahimota
ahin'andriamanitra
ahinadaba
ahindrahindrao
ahinjiro
ahintsano
ahio
ahiramita
ahirato
ahiratra
ahisahara
ahisara
ahita
ahitako
ahitam
ahitan
ahitan'ny
ahitana
ahitanao
ahitanareo
ahitanay
ahitany
ahitra
ahitsio
ahitsy
ahmed
aho
ahoa
ahoako
ahoan
ahoana
ahoanao
ahoanareo
ahoany
ahohita
ahohoka
ahona
ahondrany
ahontsankontsana
ahontsankontsany
ahor
ahoriana
ahoroko
ahoron'ny
ahosotra
ahotita
ahovoka
ahozama
ahy
ahyi
aia
aialona
aiata
aidiro
aigre
aiko
aiky
ailikilika
ailikiliny
aime
aimes
aimions
aimons
ain
ain'i
ain'ilay
ain'ireo
ain'ireto
ain'ity
ain'izay
ain'izy
ain'ny
ain'olona
aina
ainao
ainareo
ainasoa
ainay
ainga
aingam
aingana
aingao
aingintraingitra
ainona
ainsi
aintsika
ainy
airlines
aise
aises
aiza
aizan
aizim
aizina
ajan
ajanona
ajanony
ajouter
aka
akada
akademia
akademika
akaia
akaikikaiky
akaikiko
akaikin
akaikin'i
akaikin'ilay
akaikin'ireo
akaikin'ity
akaikin'izy
akaikin'ny
akaikinao
akaikinay
akaikiny
akaiko
akaiky
akalan
akalana
akama
akamako
akamanay
akamany
akambano
akana
akanga
akaniko
akanim
akanin
akaninao
akanintsika
akaniny
akanjo
akanjoko
akanjom
akanjon
akanjon'i
akanjon'ilay
akanjon'ireny
akanjon'ireo
akanjon'iza
akanjon'izy
akanjon'ny
akanjona
akanjonao
akanjonareo
akanjonay
akanjony
akany
akao
akaro
akasia
akaso
akat
akatonareo
akatony
akeldama
aki
akia
akifika
akima
akimpiny
akimpio
akin
akipio
akisaka
akisaky
akiviako
ako
akoba
akofa
akoho
akoila
akom
akombony
akon
akony
akopaka
akora
akoraina
akoranafo
akorandriaka
akorontany
akory
akrabima
aky
akziba
ala
alaba
alaelo
alahady
alaharo
alahelo
alaheloko
alahelom
alahelon
alahelon'izao
alahelonao
alahelonareo
alahelonay
alahelony
alahelovako
alahelovana
alaiko
alaim
alain
alain'i
alain'izy
alaina
alainao
alainareo
alainy
alaivo
alakamisy
alalako
alalan
alalan'i
alalan'ilay
alalan'io
alalan'ireny
alalan'ireo
alalan'iza
alalan'izany
alalan'izy
alalan'ny
alalan'olona
alalana
alalanao
alalanareo
alalanay
alalantsika
alalany
alam
alameleka
alamino
alamota
alan
alan'i
alan'ny
alany
alao
alaolana
alaotra
alarobia
alatrano
alatsaho
alatsaka
alatsinainy
alavaina
alavidavitra
alavitra
alay
albertin
albertine
albona
album
alea
alefa
alefako
alefan'i
alefan'ilay
alefan'ny
alefanao
alefanareo
alefanay
alefany
alefaso
aleha
alehako
alehan'ny
alehanao
alehanareo
alehantsika
alehany
aleho
aleksandria
aleksandrianina
aleloia
alemeta
alenteho
alentika
alentikareo
aleo
aleoko
aleon'ireo
aleon'ny
aleonao
aleonareo
aleonay
aleontsika
aleony
aleveno
alevina
alex
alexia
alfa
algoma
ali
aligna
alika
alikadia
alikakely
alikanao
aliko
alim
alin
alin'iny
alina
alinalin'i
alinalina
alitara
alitarako
alitaran'andriamanitra
alitaran'i
alitaran'ilay
alitaran'ireo
alitaran'izy
alitaran'ny
alitaranao
alitaranareo
alitarany
alkaola
all
allez
allons
almona
alnaqbi
aloa
aloaky
aloalo
aloan'ny
aloavy
aloesy
alofan'ahiahy
aloha
alohako
alohan
alohan'andriamanitra
alohan'i
alohan'ilay
alohan'ireny
alohan'ireo
alohan'izay
alohan'izy
alohan'ny
alohanao
alohanareo
alohanay
alohany
alok'i
alok'ilay
aloka
alokalok'i
alokaloka
alokaloko
alokaloky
alokalony
alokao
aloky
alon
alona
along
alors
alosy
alou
alphonse
altara
alterlinks
although
alva
alvana
always
aly
am
am'izay
ama
amada
amadihanao
amafazana
amala
amalekita
amaliana
amalon
amalona
amam
amama
amambolana
aman
aman'alina
aman'endrika
aman'endriny
aman'ondrinao
aman'ondrinareo
aman'ondrinay
aman'ondriny
aman'ondry
aman'osiko
aman'osin
aman'osin'i
aman'osin'izy
aman'osinao
aman'osinareo
aman'osiny
aman'osy
amandie
amandreniny
amandreny
amandrihany
amandy
amantarako
amantarana
amantarany
amantsara
amatorana
ambaboko
ambadik'ilay
ambadik'ireo
ambadika
ambadiky
ambadimbadika
ambahikily
ambakaina
ambakainy
ambakan
ambakan'ireo
ambaky
ambala
ambalabahoaka
ambalabamhoaka
ambalambahoaka
ambalavao
ambana
ambanidia
ambaniko
ambanilan
ambanilanitra
ambanimbanin'ny
ambanimbaniny
ambanimbanivohitra
ambanimbany
ambanin
ambanin'i
ambanin'ilay
ambanin'io
ambanin'ireo
ambanin'izy
ambanin'ny
ambanina
ambaniny
ambanivohitr'i
ambanivohitr'ilay
ambanivohitra
ambanivohitry
ambanivolo
ambany
ambara
ambarako
ambarambarany
ambarambarao
ambaran'andriamanitra
ambaran'ny
ambarana
ambaranao
ambaranareo
ambaranay
ambarantsika
ambarany
ambarao
ambaratonga
ambaratongan
ambaravarana
ambariaka
ambasadaoro
ambasadaoron
ambasadaoron'i
ambato
ambatofinandrahana
ambatoloana
ambatomainty
ambatondrazaka
ambatovy
ambavahadin
ambavahady
ambavako
ambenana
ambenany
ambeno
ambentin
ambeti
ambiansy
ambiaty
ambila
ambilobe
ambim
ambimbava
ambin
ambin'ilay
ambin'ny
ambina
ambinin
ambinina
ambininao
ambiny
ambiroa
ambiroanao
ambo
amboa
amboadia
amboakely
amboara
amboarako
amboaram
amboaran
amboaranareo
amboarina
amboarinao
amboarinareo
amboariny
amboary
ambodiangezoka
ambodiboanara
ambodibonara
ambodimbody
ambodin
ambody
ambohibe
ambohidratrimo
ambohikobaka
ambohimalaza
ambohimanambola
ambohimandroso
ambohimena
ambohimiarivo
ambohitsorohitra
ambohoka
amboleko
ambolen'andriamanitra
ambolena
ambolenao
amboleny
amboletra
amboloina
ambom
ambompontsika
ambon
ambondrombe
ambondrona
ambongadiny
amboniko
ambonin
ambonin'i
ambonin'ilay
ambonin'iny
ambonin'io
ambonin'ir
ambonin'ireny
ambonin'ireo
ambonin'ity
ambonin'izany
ambonin'izay
ambonin'izy
ambonin'ny
amboninao
amboniny
ambonivohitr
ambonivohitra
ambonongo
ambony
amborahako
amboropotsy
ambositra
ambovombe
ambozizy
ambozonana
amby
amelao
amelomany
amen
amena
amerana
amerenanao
amerika
ametista
ametrahako
ametrahan'izy
ametrahan'ny
ametrahana
ametraho
ami
amidin'ny
amidiny
amidio
amidy
amie
amignagny
amihinana
amiko
amim
amin
amin'ahiahy
amin'alahelo
amin'anana
amin'andriamani
amin'andriamanitr'i
amin'andriamanitra
amin'andriamanitrareo
amin'andriamanitsika
amin'antambo
amin'antony
amin'i
amin'ialahy
amin'ilay
amin'inona
amin'iny
amin'io
amin'ir
amin'ireny
amin'ireo
amin'ireto
amin'iretsy
amin'itony
amin'itsy
amin'ity
amin'iza
amin'izany
amin'izao
amin'izay
amin'izy
amin'ny
amin'olombelona
amin'olon
amin'olona
aminaniany
aminao
aminareo
aminay
amindrana
amindrany
amindrao
amindroana
amintsika
aminy
amiraly
amirapiratan'andriamanitra
amis
amitahany
amitiagny
amitsika
amizany
amizao
amizay
ammbarao
amnjanaka
amo
amoahako
amoahan'ny
amoahanao
amoahy
amoizako
amoizana
amoka
amongoranao
amonima
amonita
amonjen'i
amonjena
amonjenao
amonoana
amontana
amor
amorita
amorom
amorompatana
amoron
amoron'i
amoron'ilay
amoron'ireny
amoron'ny
amorona
amoronako
amoronakona
amoronany
amorony
amour
amoureux
amours
ampahadimin'izay
ampahadimin'ny
ampahadiminy
ampahafantarana
ampahafantariko
ampahafantarin'andriamanitra
ampahafantarinao
ampahafantarinareo
ampahafantarinay
ampahafantariny
ampahafantaro
ampahafolon
ampahafolon'ireny
ampahafolon'izany
ampahafolon'izay
ampahafolon'ny
ampahafolony
ampahalalao
ampahan'ilay
ampahany
ampahatelon'ireny
ampahatelon'ny
ampahatelona
ampahatelonareo
ampahatelony
ampahatsiahivako
ampahatsiahiviko
ampahatsiahivina
ampahatsiahivo
ampahazaton'ny
ampahefatry
ampahenin'ny
ampaherezo
ampahibemaso
ampahirato
ampahorina
ampahory
ampakariko
ampakarina
ampamoaka
ampamoizo
ampanajana
ampanambadio
ampanantena
ampanantenaiko
ampanantenain'andriamanitra
ampanantenain'i
ampanantsoy
ampanaovin'i
ampanaovina
ampanaoviny
ampanaovy
ampanataovana
ampanatony
ampandalovana
ampandefero
ampandehanina
ampandehaniny
ampandehano
ampandrana
ampandreneso
ampandrio
ampandroso
ampandrosoy
ampanetre
ampangaina
ampangainy
ampangao
ampanginina
ampangino
ampango
ampangotraho
ampanjakao
ampankarina
amparafara
amparibe
ampasana
ampatorinao
ampatory
ampela
ampelantananao
ampelasoa
ampelatanany
ampemby
ampi
ampiadiany
ampiakanjoy
ampiakarany
ampiakarina
ampiakariny
ampiakaro
ampiako
ampiampy
ampian
ampian'andriamanitra
ampian'ny
ampiana
ampianao
ampianareo
ampianariko
ampianarin'andriamanitra
ampianarin'ny
ampianarin'olon
ampianarin'olona
ampianarina
ampianarinao
ampianarinareo
ampianarinay
ampianariny
ampianaro
ampiandohana
ampiantaina
ampiany
ampiarahina
ampiarahinay
ampiaraho
ampiasaiko
ampiasain'andriamanitra
ampiasain'izy
ampiasain'ny
ampiasaina
ampiasainao
ampiasainareo
ampiasainy
ampiasako
ampiasana
ampiasao
ampiasiany
ampiasàna
ampidiniko
ampidino
ampidiriko
ampidirin'i
ampidirina
ampidiro
ampifaliana
ampifalio
ampifanatrehina
ampifoha
ampihantaina
ampiharana
ampihariko
ampiharina
ampihariny
ampiharo
ampihimamba
ampihomehezo
ampijaliana
ampijalin'ny
ampijalina
ampijalinao
ampijalinareo
ampijaliny
ampijinjana
ampijoroany
ampina
ampindramiko
ampindramo
ampinga
ampingako
ampingan'i
ampingan'ireo
ampingan'izay
ampingan'izy
ampingan'ny
ampinganao
ampinganay
ampingantsika
ampingany
ampinonoy
ampio
ampiomano
ampion
ampiononin'andriamanitra
ampiononina
ampirafesina
ampiraisina
ampirantiana
ampireheto
ampiriaka
ampiriatiko
ampirimo
ampirisihako
ampirisihinay
ampirisihiny
ampirisiho
ampisamborinareo
ampisambory
ampisehoan'izy
ampisehoanao
ampisehoy
ampisotroinao
ampisotroiny
ampisotroy
ampita
ampitafiako
ampitaha
ampitahaina
ampitahao
ampitahy
ampitainay
ampitaingeno
ampitampitao
ampitan
ampitan'i
ampitan'ilay
ampitan'ny
ampitandremako
ampitandremo
ampitao
ampitomboina
ampitomboiny
ampitomboy
ampitondrain'ny
ampitondrainareo
ampitondray
ampitony
ampitovina
ampitso
ampitson'iny
ampitson'ny
ampitsonao
ampivarina
ampizara
ampo
ampodiko
ampodin'i
ampodio
ampofoan
ampofoiko
ampofoko
ampoizina
ampoizinareo
ampoiziny
ampoko
ampombo
ampon
amponao
ampondra
ampondradia
ampondralahy
ampondran'i
ampondran'iza
ampondran'ny
ampondranao
ampondranareo
ampondranay
ampondrantsika
ampondrany
ampondravavin'i
ampondravavy
amponga
ampongabendanitra
ampongatapaka
ampongatapakao
ampotony
ampy
amrafela
amramita
amy
an
an'adiny
an'ady
an'ala
an'alinaliny
an'alinkisa
an'ambohimiarivo
an'andriamani
an'andriamaniny
an'andriamanitra
an'andriamanitrao
an'andriamanitrareo
an'andriamanitray
an'andriamanitro
an'andriamanitry
an'andriamanitsika
an'andriamatoa
an'arabe
an'arivoarivony
an'arivony
an'avona
an'i
an'ialahy
an'ikaky
an'ilay
an'iny
an'io
an'ir
an'ireny
an'ireo
an'ireto
an'iretsy
an'isa
an'itsy
an'ity
an'iza
an'izany
an'izao
an'izay
an'izy
an'ny
an'ohatra
an'olombelona
an'olon
an'olona
ana
anaba
anabaviko
anabavin
anabavin'i
anabavin'ilay
anabavin'ireo
anabavin'izy
anabavin'ny
anabavinao
anabavinareo
anabavinay
anabavintsika
anabaviny
anabavy
anadahiko
anadahin
anadahin'i
anadahinao
anadahinay
anadahiny
anadahy
anadino
anadiovana
anafarako
anafenan'izy
anafihan'ny
anafihana
anafihanao
anahafako
anaharata
anahy
anaia
anajan'ity
anajan'izy
anaka
anakampo
anakandriamasoko
anakandriamasonao
anakandriamasony
anakavy
anaki
anakiray
anakita
analakely
analako
analalava
analamanga
analana
analanjirofo
analany
analogh
anamafisako
anamalaho
anamasinako
anambarako
anambarana
anamboarana
anamboarany
anamboary
anameleka
anamelohako
anamelohana
anamima
anamparako
anamparan'andriamanitra
anamparan'i
anamparany
anamparo
anampiana
anampianao
anampy
anan
anana
ananako
ananam
ananan
ananan'i
ananan'ilay
ananan'izay
ananan'ny
ananana
anananao
anananareo
anananay
ananantsika
ananany
ananao
ananarako
ananas
ananay
anandratana
anandratanao
anangonana
anania
ananiasy
anankinako
anankiray
anankiroa
ananona
anantenan'ny
anantenanay
anantonany
anany
anao
anaovako
anaovan
anaovan'i
anaovan'ialahy
anaovan'ireo
anaovan'izy
anaovan'ny
anaovana
anaovanao
anaovanareo
anaovanay
anaovany
anaovy
anaparitahan'i
anaparitahana
anarahako
anarahanao
anarako
anaram
anaran
anaran'andriamani
anaran'andriamanitra
anaran'andriamanitrao
anaran'andriamanitray
anaran'andriamanitro
anaran'i
anaran'ilay
anaran'iny
anaran'io
anaran'ireny
anaran'ireo
anaran'ity
anaran'iza
anaran'izany
anaran'izay
anaran'izy
anaran'ny
anarana
anaranao
anaranareo
anaranay
anarano
anarantsika
anarany
anararao
anararaotiny
anareo
anariana
anariko
anarin'andriamanitra
anarin'ilay
anarina
anarinao
anarinay
anariny
anaro
anaronany
anasitranana
anata
anataneraka
anatanteraka
anatero
anatiko
anatin
anatin'i
anatin'ilay
anatin'iny
anatin'io
anatin'ireny
anatin'ireo
anatin'izany
anatin'izay
anatin'izy
anatin'ny
anatinao
anatinareo
anatinay
anatintsika
anatiny
anatota
anatotita
anatra
anatrehako
anatrehan
anatrehan'andriamaniny
anatrehan'andriamanitra
anatrehan'andriamanitrao
anatrehan'andriamanitray
anatrehan'andriamanitsika
anatrehan'i
anatrehan'ilay
anatrehan'io
anatrehan'ireny
anatrehan'ireo
anatrehan'iza
anatrehan'izay
anatrehan'izy
anatrehan'ny
anatrehanao
anatrehanareo
anatrehanay
anatrehantsika
anatrehany
anatro
anatry
anaty
anavahana
anavotana
anay
anazavantsika
anazy
andafin
andaingana
andakan
andakilasy
andalana
andalovana
andalovanao
andalovany
andamosiko
andamosin'ilay
andamosin'ny
andamosinao
andamosiny
andana
andanianao
andaniany
andanin'ilay
andaniny
andanona
andao
andaohandihy
andapa
andasy
andatsaho
andavan
andavanandro
andavandavampako
andavany
andefarana
andefasako
andefasanao
andefasany
andefaso
andeferako
andeferan'i
andefi
andefimandry
andefomandry
andeha
andehanako
andehanan'ny
andehanana
andehanantsika
andehanany
andehano
andevenana
andevo
andevolahy
andevon'i
andevon'izay
andevon'ny
andevonao
andevony
andevovavy
andevoziko
andevozin'ny
andevozina
andevozinao
andia
andiam
andian
andian'olona
andian'ombilahy
andian'omby
andian'ondrin'andriamanitra
andian'ondrin'i
andian'ondrin'ny
andian'ondrinao
andian'ondrinareo
andian'ondriny
andian'ondry
andian'osy
andiana
andiany
andidiako
andidian'ny
andihizana
andilako
andilamena
andilan'i
andilan'izy
andilan'ny
andilana
andilanao
andilanareo
andilany
andinim
andinin
andininy
ando
andoary
andoavam
andoavana
andoavanareo
andoha
andohako
andohasa
andohasaha
andom
andon
andon'ny
andonao
andoniaina
andoroana
andosiran'izy
andosirana
andosiro
andrahoina
andrahoy
andraiki
andraikiny
andraikitr'ireo
andraikitr'izy
andraikitra
andraikitrao
andraikitrareo
andraikitry
andraindraina
andraisako
andraisan
andraisana
andraisanao
andrakandramanao
andrakofana
andrakofanao
andramako
andramo
andrandraiko
andrandrain'ny
andrandraina
andrandrainay
andrangotra
andranobe
andrao
andraony
andrarahana
andraran'i
andrasako
andrasana
andrasanao
andrasantsika
andrasany
andraso
andravaka
andravana
andravanao
andray
andrea
andrefan
andrefan'i
andrefan'ilay
andrefan'ny
andrefana
andrefany
andrehetana
andrerak'aina
andresen'ny
andri
andria
andriako
andriamadiharison
andriamadison
andriamahaleo
andriamahasoanavalona
andriamaholy
andriamainty
andriamalala
andriamampiadana
andriamampionona
andriamana
andriamanalina
andriamanampisoa
andriamanana
andriamanankoavy
andriamanantenasoa
andriamanantsoa
andriamanga
andriamani
andriamanibavin'ny
andriamanibavintsika
andriamanibavy
andriamaniny
andriamanitr
andriamanitr'i
andriamanitr'ilay
andriamanitr'ireny
andriamanitr'ireo
andriamanitr'ity
andriamanitr'izao
andriamanitr'izy
andriamanitra
andriamanitrao
andriamanitrareo
andriamanitray
andriamanitro
andriamanitry
andriamanitsika
andriamaro
andriamaromana
andriamaromanana
andriamasinoro
andriamasy
andriamatoa
andriambahiny
andriambavilanitra
andriambavin'i
andriambaviny
andriambavy
andriambelonarivo
andriambonivola
andriamby
andriamiandrisoa
andriamiarisoa
andriamihaja
andriamiharimanana
andriamiharisoa
andriamindrisoa
andriamitantsoa
andriamizakamanana
andriamparanony
andriamparany
andriana
andrianabela
andrianaivo
andrianaivoarison
andrianako
andrianan'i
andrianan'ireo
andrianan'izy
andrianan'ny
andriananahireana
andriananao
andriananareo
andriananay
andrianandrainy
andrianandrasanomenjanahary
andrianantanarivo
andrianantenaina
andrianantoandro
andrianany
andrianasolo
andrianasy
andrianatehy
andrianavomanana
andrianiainarivelo
andrianiko
andrianilaina
andrianina
andrianinao
andrianirina
andrianjafimahefarinjo
andrianjafy
andrianjatovo
andriankinana
andrianoasy
andriantaolo
andriantomponera
andriantsiferana
andriantsitohaina
andriantsoa
andriariliva
andriarimalala
andriarivony
andriatodisoa
andriatody
andriatsihala
andriatsitohaina
andrikiny
andriko
andrimanantena
andrimanitra
andrimaso
andrimpanjakana
andrin
andrin'ilay
andrin'ny
andrinao
andrinareo
andrinay
andringitra
andriniaiana
andriniaina
andriny
andripahan'ny
andrisoa
andrnivohitra
andro
androanay
androany
androbe
androko
androky
androm
andrompihafiana
andron
andron'i
andron'ireny
andron'ireo
andron'izy
andron'ny
andronao
andronareo
andronay
androngo
androngobe
androngom
androngon
androntsika
androny
androso
androtoko
androtr'iny
androtsay
androtsika
androvitana
androy
andry
anefa
anefany
anehoako
anehoan
anehoana
anehoanao
anehoko
anehoy
aneken'ny
anekena
anekenareo
anelakela
anelanelan
anelanelan'i
anelanelan'ilay
anelanelan'ireo
anelanelan'izany
anelanelan'izy
anelanelan'ny
anelanelanao
anelanelanareo
anelanelany
anelingelenanao
anelobe
anema
anendrena
anenenako
anenenana
anenenanao
anesorana
anesorany
aneta
angaba
angadin
angadinombinareo
angadinomby
angady
angah
angaha
angahy
angalany
angalao
angalarina
angamba
anganha
angano
anganoangano
angaredon
angatahan'ny
angatahana
angatahanareo
angatahany
angatahiko
angatahin'i
angatahin'ny
angatahinao
angatahinareo
angatahinay
angatahintsika
angatahiny
angataho
angatao
angatra
ange
angeh
angela
angelinkary
angelo
angelphine
angezoka
angidimby
angie
angina
anginana
angindina
angividia
angivy
angleterre
anglisy
angolampeo
angolanao
angolangola
angolangolako
angolangolanao
angolavaitra
angoniko
angonin'ny
angonina
angoninao
angoniny
angony
angotinao
angotingoty
angoty
angovo
aniama
anicet
anicette
anie
aniiii
anikeheo
anilako
anilan
anilan'i
anilan'ilay
anilan'ireo
anilan'ny
anilanao
anilanay
anilanilana
anilany
anima
animbanao
aninkeo
aninona
anio
anirahako
anirahana
anirahanao
anirian'ny
anisan
anisan'i
anisan'ilay
anisan'ireny
anisan'ireo
anisan'ity
anisan'izany
anisan'izao
anisan'izay
anisan'izy
anisan'ny
anisany
anisy
anivon
anivon'ireo
anivon'izany
anivon'ny
anivona
anivonareo
anivony
anjairana
anjakan
anjakan'izy
anjakan'ny
anjakany
anjakao
anjanamasina
anjara
anjarako
anjaran
anjaran'i
anjaran'ilay
anjaran'ireny
anjaran'ireo
anjaran'izay
anjaran'izy
anjaran'ny
anjaran'olon
anjaranao
anjaranareo
anjaranay
anjaranirina
anjarantsika
anjarany
anjaratiana
anjavidy
anjeliko
anjelin'andriamanitra
anjelin'i
anjelin'ilay
anjelin'izy
anjelin'ny
anjeliny
anjely
anjiana
anjoanjo
anjoma
anjomara
anjombona
anjombonareo
anjombony
anjorom
anjoron
anjozorobe
anjra
ankafihizo
ankafizin'ny
ankafiziny
ankafizo
ankahalaiko
ankahalain'izy
ankahalain'ny
ankahalaina
ankahalainao
ankahalainy
ankahalan'izao
ankahalana
ankahalany
ankahalao
ankahariana
ankahery
ankaiva
ankalazain'izy
ankalazaina
ankalazainareo
ankalazao
ankalozaiko
ankamamy
ankamantatra
ankamantatrao
ankamantatro
ankamaroan
ankamaroan'ireo
ankamaroan'izay
ankamaroan'izy
ankamaroan'ny
ankamaroanareo
ankamaroany
ankamatatra
ankanavaka
ankaninao
ankanjo
ankanjony
ankany
ankapobeny
ankasitrahako
ankasitrahan'andriamanitra
ankasitrahan'i
ankasitrahan'ny
ankasitrahana
ankasitrahanao
ankasitrahany
ankasitraho
ankaso
ankason
ankason'ity
ankasoparana
ankatakonana
ankatoaviko
ankatoavinao
ankatoavinareo
ankatoavinay
ankatoaviny
ankatoavy
ankavanako
ankavanan'andriamanitra
ankavanan'i
ankavanan'ilay
ankavanan'ny
ankavanana
ankavananao
ankavanany
ankavia
ankaviako
ankavian'i
ankavian'ny
ankavianao
ankavianay
ankaviany
ankazomalaza
ankehitiny
ankehitriny
ankehitry
anki
ankiben
ankibo
ankikeliko
ankilabao
ankilany
ankilizato
ankinafina
ankiniko
ankinina
ankino
ankira
ankiroa
ankiteny
ankizikely
ankizilahikely
ankizilahin'izy
ankizilahy
ankizivaviny
ankizivavy
ankizy
ankoatr
ankoatra
ankohonako
ankohonan
ankohonan'andriamanitra
ankohonan'i
ankohonan'ilay
ankohonan'izy
ankohonan'ny
ankohonan'olona
ankohonana
ankohonanao
ankohonanareo
ankohonany
ankolafiny
ankona
ankony
ankory
ankoso
ankosotra
ano
anoako
anohanana
anohanany
anokanany
anoloako
anoloan'i
anoloan'ilay
anoloan'io
anoloan'ireny
anoloan'ireo
anoloan'ity
anoloan'izao
anoloan'izy
anoloan'ny
anoloana
anoloanao
anoloanareo
anoloantsika
anoloany
anolorako
anolorana
anoloranay
anomano
anombanan'ny
anombanana
anombanany
anome
anomezako
anomezam
anomezan'io
anomezan'izy
anomezany
anomezo
anompoako
anompoany
anona
anongotana
anontaniana
anontanianao
anontanianareo
anontaniany
anontanio
anoratako
anorenana
anorenanao
anosibe
anosihosena
anosorana
anosorany
anosy
anota
anotany
anova
anozonana
anozonantsika
anselme
antalaha
antambo
antampon
antanana
antananarivo
antanarivo
antanimora
antanivao
antany
antaontsika
antara
antena
antenaiko
antenain'ny
antenaina
antenainareo
antenainay
antenaintsika
antenainy
antenatenan
antenatenany
antenimieram
antenimierandoholona
anteny
anthenus
anthonio
anthony
anti
anticridienne
antikristy
antilahy
antilopa
antiokia
antipatria
antitra
antitranteriny
antoandro
antoandrobe
antoandrobenanahary
antoandroko
antoine
antoka
antoko
antokom
antokon
antokon'i
antokon'ny
antokon'olona
antokona
antokony
antokotokon
antoky
antom
anton
anton'ilay
anton'io
anton'izany
anton'izao
anton'izy
anton'ny
antonio
antonona
antonony
antontam
antontan
antontany
antony
antotia
antra
antrano
antratrany
antrendry
antrnao
ants
antsa
antsaiko
antsaina
antsainao
antsainy
antsakany
antsaly
antsamotady
antsangory
antsapaka
antsapika
antsasa
antsasadalany
antsasak'adiny
antsasak'i
antsasak'ilay
antsasak'ireo
antsasak'izany
antsasak'izy
antsasaka
antsasaky
antsasany
antsenan'i
antsibe
antsika
antsim
antsin
antsin'ny
antsinan
antsinanan
antsinanana
antsinjarany
antsipika
antsirabe
antsiraka
antsiranana
antsitra
antso
antsoantso
antsoantsoko
antsoantson'ny
antsoantsonao
antsohihy
antsoiko
antsoin
antsoin'andriamanitra
antsoin'i
antsoin'izy
antsoin'ny
antsoina
antsoinao
antsoinareo
antsoiny
antsojay
antsoko
antsokosoko
antson
antson'i
antson'ireo
antson'izy
antsonao
antsonay
antsonjay
antsony
antsoy
antsy
anxieux
any
anyeeee
ao
aok
aok'izay
aoka
aolan'ny
aolany
aolo
aomby
aona
aondran
aondrika
aongany
aoreno
aoriako
aorian'ilay
aorian'ireo
aorian'izany
aorian'izay
aorian'izy
aorian'ny
aoriana
aorianako
aorianan'i
aorianan'ilay
aorianan'izy
aorianan'ny
aoriananao
aoriananay
aorianantsika
aorianany
aorianao
aorianareo
aoriany
aorin'andriamanitra
aorina
aoriny
aotirisy
apaima
apango
aparitaho
aparitaka
aparitakao
aparitakareo
aparitako
aparitany
apart
apartheid
apemba
apetaho
apetraho
apetraka
apetrakao
apetrako
apetrany
apetrao
apia
apitrapitrany
apm
apmf
apoaka
apokalypsy
apololoitranao
apolonia
apolyona
apombo
aponga
apostolin'i
apostolin'ny
apostolinareo
apostoliny
apostoly
apotrapotrako
appelait
appelle
approchent
ar
ara
araba
arabe
arabia
arabo
arahaba
arahabaina
arahabainareo
arahabao
arahan
arahana
arahany
arahiko
arahim
arahin
arahin'izy
arahin'ny
arahina
arahinao
arahinareo
arahinay
arahiny
araho
arai
araikitra
araiky
arak
arak'asa
araka
arakara
arakaraka
araky
arama
aramagedona
aramianina
aran'i
arana
arangarangako
arapaka
arapaky
arapany
araraho
araraka
araraky
ararany
araraotina
araraotinao
araraoty
ararata
aravaha
arba
arbatita
arbita
arcades
ardita
ardona
areheto
arehitra
arehitry
arelita
arely
arendrika
areno
areopago
arerahan'ny
arerahana
areti
aretiko
aretim
aretin
aretin'ny
aretina
aretinao
aretinay
aretiny
ari
aria
ariako
arian'ny
ariana
arianao
ariary
aridata
ariday
arides
arilala
arimanana
arimatia
arina
arinala
aringan'andriamanitra
aringan'i
aringana
aringanao
aringano
ario
aripaho
aripaka
aripakao
aripako
aripany
arisay
arisoa
arison
aristarko
aristide
aritiana
aritra
aritro
arivo
arivoarivo
arivoarivon'i
arivon'i
arivonimamo
arivony
arkanjely
arkipo
arkita
armp
arms
arnaud
arnona
arny
aro
aroa
aroda
arodano
arodita
aroera
aroerita
arofanina
arofenitra
aroma
aron'akanjo
aron'akanjonao
arona
arora
arorako
aroso
arosoko
aroson'ny
arosonao
arosony
arosoy
arotsaka
around
arovako
arovan'i
arovan'ny
arovana
arovanao
arovany
arovinai
arovinao
arovy
arpada
arrangements
arrive
arrivedercci
arriver
arrose
arson
artemisin'ny
arthur
arvada
arvadita
ary
asa
asabotsy
asafotofoton'ny
asaia
asaiko
asain
asain'andriamanitra
asain'i
asain'ilay
asaina
asainao
asaintsika
asainy
asaivo
asakasakao
asakasakareo
asakasantsika
asako
asan
asan'andriamanitra
asan'i
asan'ilay
asan'iny
asan'ireo
asan'izy
asan'ny
asana
asanao
asanareo
asanay
asandrany
asandrato
asandratr'i
asandratra
asandratray
asandratro
asandroky
asantsika
asany
asao
asara
asarela
asarona
asavoanan
asbela
asbelita
asdoda
asdodita
asedra
aseho
asehoko
asehon
asehon'andriamanitra
asehon'i
asehon'ny
asehonao
asehonareo
asehonay
asehony
asehoy
asetriko
asetrin
asetrinao
asha
asiako
asian
asian'ny
asiana
asianao
asianareo
asianay
asiantsika
asiany
asie
asiko
asimananana
asina
asio
asisika
asitriho
ask
askelona
asna
aso
asolo
asoloko
asongadina
asorita
aspata
asrielita
assez
associatif
assoumacou
assouvir
astarota
astartita
asterota
asvata
asyra
asyrianina
at
atada
atahorako
atahoran'i
atahoran'izay
atahoran'izy
atahoran'ny
atahorana
atahoranao
atahoranareo
atahorantsika
atahorany
atahory
atahy
ataingeno
ataingina
ataka
atakalo
atakaloko
atakalonay
atakalony
atakalozy
atalata
atambaro
atambatra
atamberinao
atambo
atamin
atanjaho
atanjao
atao
ataoko
ataom
ataon
ataon'andriamanitra
ataon'i
ataon'ialahy
ataon'ilay
ataon'iny
ataon'ireny
ataon'ireo
ataon'ity
ataon'izay
ataon'izy
ataon'ny
ataon'olona
ataonao
ataonareo
ataonay
ataontsika
ataony
ataotao
ataovy
atara
atarima
atarota
atelina
atelinareo
atena
atenianina
atera
ateraka
aterakao
aterakareo
ateraky
aterany
ateriko
aterin'ilay
aterin'ny
aterin'olona
aterina
aterinao
ateriny
atero
ati
atiala
atidoha
atiko
atin
atiny
atitany
atlay
atleta
ato
atoandro
atodiho
atodina
atodiny
atody
atokako
atokan'andriamanitra
atokana
atokanay
atokano
atokany
atokisako
atokisana
atokisanao
atokisanareo
atokisany
atokona
atokàny
atolony
atolory
atolotr'andriamanitra
atolotr'i
atolotr'ireo
atolotr'izy
atolotra
atolotrao
atolotrareo
atolotray
atolotro
atolotry
atombohy
atomboka
atomboko
aton
atonoy
atont
atontany
atony
atopatopany
atopazo
atorakao
atorian'ilay
atorian'izay
atoriana
atorianao
atoriany
atoro
atoroko
atoron'andriamanitra
atoronao
atorony
atoroy
atosaho
atosaka
atoseho
atosi
atosika
atosiky
atosiny
atositokika
atositosika
atositosikao
atou
atours
atouts
atrakao
atrany
atrehany
atrehin
atrehin'ny
atrehina
atrehinao
atreho
atrehonareo
atrikasa
atrota
atsaharo
atsahatr'andriamanitra
atsangako
atsangan'ny
atsangana
atsangano
atsangany
atsapanao
atsembohana
atsimo
atsimoatsinanana
atsimon'i
atsimon'ilay
atsimon'iny
atsimon'ny
atsimonao
atsimondrano
atsimotsimo
atsimotsimon
atsinana
atsinanan
atsinanan'i
atsinanan'ilay
atsinanan'ny
atsinanana
atsinanany
atsingereno
atsipazo
atsipin'ilay
atsipinao
atsipinareo
atsipiny
atsipy
atsobohy
atsoboko
atsofohy
atsojay
atsonika
atsoniky
atsoro
atsory
atsotra
atsy
attend
attendent
attendre
attendrons
attends
attirent
attirer
aty
aucun
aucune
augustin
augustina
auras
aurore
aussi
australie
aut
auteurs
autour
autrefois
autres
autrichienne
auxquels
ava
avadibadiky
avadika
avadiko
avadiny
avahako
avahan'ny
avahana
avahany
avaho
avais
avako
aval
avalin'andriamanitra
avalin'i
avaliny
avalona
avalony
avaly
avana
avances
avant
avao
avara
avaradrano
avaratr'i
avaratr'ilay
avaratra
avaratrao
avaratrin
avaratry
avatra
avela
avelaho
avelako
avelan
avelan'andriamanitra
avelan'i
avelan'izay
avelan'izy
avelanao
avelanareo
avelanay
avelantsika
avelany
avelao
avelo
avelonao
avembenan'ny
avena
aveo
avereno
averiko
averimberina
averimberiny
averina
averinao
averinareo
averiny
aveu
avezivezin'ny
avia
aviavia
aviavidia
aviaviko
aviavin'izy
aviavinao
aviavinareo
aviaviny
aviavy
aviko
aviliny
avilio
avily
avima
avin'ny
avinao
avintsika
aviny
avita
avizananao
avo
avoahy
avoaka
avoakako
avoakan'ny
avoakanao
avoakany
avoavo
avocats
avoir
avoirs
avoko
avokoa
avokona
avokoooa
avon'i
avon'ny
avona
avonao
avonavon
avonavony
avons
avony
avotako
avotana
avotanao
avotr
avotr'i
avotra
avotsory
avotsotra
avoty
avoue
avreka
avrily
avy
away
ay
ayant
ayez
az'ela
aza
azafady
azan
azarela
azaria
azavao
azazia
azeka
azema
azera
azerany
azerao
azia
aziela
aziza
azmaveta
azmona
aznota
azo
azoako
azoazo
azoazon
azoba
azoko
azom
azon
azon'i
azon'ilay
azon'ireo
azon'ity
azon'iza
azon'izany
azon'izay
azon'izy
azon'ny
azon'olona
azona
azonao
azonareo
azonay
azoniko
azontsika
azony
azotory
azrikama
azy
baba
babangoana
babaïque
babeko
babela
babena
babenao
babinao
babo
baboinay
babon'i
babon'ny
babonao
babonareo
babony
baby
babylona
babylonianina
back
badiko
badin'i
badin'ny
badiny
bado
badobado
bady
bagasy
bagnole
bahana
baharomita
bahia
bahiny
bahoaka
bahoakan
bahorima
bahy
baiboly
baies
baiko
baikoin'ny
baikoina
baikoiny
baikon
baikon'i
baikon'ilay
baikon'ny
baikonao
baikony
bainga
baingan
baissant
bajajy
baka
bakbakara
bakbokia
bakisiny
bakoly
bakota
bakà
bal
bala
baladana
balade
balaha
balala
balan'i
balanao
baleta
baliaka
baliana
baliha
balika
baliny
balsama
bamota
bana
bandikelinao
bandikely
bandy
banga
bangoiko
banina
banjinina
banjininao
banjino
banky
banni
banona
bantiana
bantsilana
bao
baolina
baomba
baotin'izay
baovao
bara
barabababab
barahina
baraka
barakako
barakanao
barakay
baran'ny
baranahiny
barany
barara
bararata
baratra
baravarakely
baravarako
baravaran'i
baravaran'ilay
baravaran'ny
baravarana
baravaranao
baravarankelin'ny
baravarankelintsika
baravarankely
baravarantsika
baravarany
baravaravana
baria
barijaona
barimbazaha
barjesosy
barnabasy
barnea
baromita
barotr'i
barotr'izao
barotra
barotrao
barsabasy
bartolomeo
bary
basana
basebeta
basin
basy
bat
bata
bataina
batana
batao
bateau
bateaux
batena
batisa
batisan'i
batisany
batita
bato
baton'ny
batony
batravatra
batsy
battre
bava
bavahadin'i
bavahadin'ilay
bavahadin'ny
bavahadinao
bavahadinareo
bavahadiny
bavahady
bavaka
bavako
bavan
bavan'ilay
bavan'ireto
bavan'izy
bavan'ny
bavanao
bavanareo
bavany
baventy
bavoroko
bavoronareo
bavorony
baza
bazaha
bazolimanjato
be
bealanana
bealia
bealota
beau
beaucoup
beauty
beaux
bebe
bebenay
bebeny
bebex
beby
bedaina
bedana
bedeia
bedesina
bedibedy
bediko
bedin
bedy
been
befahatany
befelatanana
before
behava
behavior
behemota
behind
behivavy
being
bekerita
bekily
bekopaka
bekoto
bela
beliada
beliala
belie
believe
belirano
belita
belle
belles
beloha
belolo
beloma
belona
belong
belongs
beltesazara
bemidina
bemolanga
ben
ben'ny
bena
benaia
benandro
bene
benilde
benino
benja
benjamin
benjamina
benjaminita
benjarivelo
benjilany
benoba
benoit
benota
beny
beona
bera
beraia
beraka
beranto
bercerai
berenika
beri
beria
berila
berita
bernard
bero
beroroha
berota
berotahy
berotita
bery
besalampy
besarety
beside
besinimaro
besoin
bessa
best
beta
betania
betanimena
betela
betelan'i
betelita
beti
betifaga
betioky
betizata
betlehema
betleheman'i
betlehemita
betola
betonima
betroka
betsaida
betsak
betsaka
betsiboka
better
bevava
bevohoka
bevohokan'i
bezeka
bianco
biavy
bibidia
bibikely
bibilava
bibiny
biby
bidy
bien
bientbt
bienvenu
bienvenue
bigta
bigvay
bijoux
bika
bikabikan
bikabikan'olombelona
bikabikan'olona
bikabikany
bikan'ny
bikana
bikanao
bikany
bikata
bikrita
bilangina
bilany
bilarziozy
bileama
bilga
bilgay
biliany
bilona
bilsana
bimala
bin
binany
biometrika
birao
biraom
biraon
biriky
birsa
biry
bis
bise
bislama
bisoo
bisous
bita
bitan'andriamanitra
bitana
bitanao
bitanareo
bitantsika
bitany
bitro
bitrodia
bitrom
bitsi
bitsibitsihina
bitsibitsihinareo
bitsibitsika
bitsik
bitsika
bitsiky
bitsim
bitynia
biziotia
bizta
blanc
blanche
blanches
bless
bleu
blind
blondes
bmw
bngrc
boa
boafefina
boafidiko
boafidin'andriamanitra
boafidinao
boafidiny
boafidy
boahary
boalobok'i
boaloboka
boalobokao
boaloboky
boalohany
boana
boanerjesy
boanjo
boankazo
boaozona
boary
boatim
boaty
boaza
boba
boboka
bobongolo
bocages
bodegany
bodifiakarana
bodirindrina
bodo
bodofotsy
boeni
boeny
bofinay
bogosy
bohoka
bohozonana
boina
bois
boite
boka
bokatra
bokatrao
bokatrareo
bokatray
bokatro
bokatry
bokero
bokiko
bokim
bokima
bokin
bokin'i
bokin'ny
bokinao
bokiny
bokon
bokona
bokony
bokovoko
boky
bola
bolafotsy
bolam
bolamena
bolan
bolan'i
bolana
bolanareo
bolangina
bolany
bolo
boloky
bolon'ny
bolony
bon
bona
bonaika
bongo
bongolava
bongon'ny
boninahiny
boninahitr'i
boninahitr'ireo
boninahitra
boninahitrao
boninahitry
boninkazo
bons
bony
boramena
borasana
bord
boredika
boribory
born
borokely
boromahery
boromailala
boromanga
borona
boronkely
borosy
bory
bossa
bosser
botakely
both
boto
botomanirisoa
boton
bototsara
botrefona
botry
bouches
bouteille
bovine
bovoka
boza
bozaka
bozenay
bozeza
bozita
bozizy
bozkata
bozon'ireo
bozon'ny
bozonao
bozra
bozy
bras
brasele
break
breaker
bridge
brigade
brille
bring
brings
brisant
brisent
british
brosy
brousse
bruit
brume
brunes
build
bulletin
but
by
bye
bôna
c'est
cabaret
cache
cachera
cadeau
cage
cahier
cajolent
calcutta
calm
calmy
camion
camp
cannot
capitaine
car
care
caressent
caresses
carl
carles
carte
case
cathia
cause
cci
ccm
ccmaj
ccpreas
ceci
cela
cendres
ceni
centime
cesse
ceux
cfm
cgp
chacun
chacune
chagrin
chaine
chambre
change
chanson
chansonnette
chansons
chant
chante
chantent
chanter
chanteurs
chantons
chants
chapeau
chaque
charles
charmant
charmantes
charme
charmeny
charmeuses
chaud
chaudes
chazane
chemin
chemins
chercher
chercherais
cheveux
chez
chicago
children
chips
chorus
chose
choses
chou
christian
christina
christine
christophe
chu
château
ciel
ciels
cime
cinquante
clara
clarck
clarisse
clark
claude
claudette
claudion
close
coco
cocotiers
coda
coeur
coeurs
coin
collier
colliers
come
comes
comme
commer
commets
comoriens
comp
comprendre
comptes
conamept
congo
connekt
constantin
continuent
continues
cool
copains
coquette
coquettes
coquillages
coquin
coralmad
corinne
corona
corps
cos
could
couleurs
couple
courbettes
couroucouuu
court
cousin
couvrant
crient
cris
crois
cruche
csao
csb
cua
cueilli
cueillir
cuit
cultures
cumo
cydolain
cylliah
célestina
d'accord
d'amour
d'amoureux
d'antananarivo
d'articles
d'efa
d'entre
daba
daberata
dabeseta
dabiera
dabilio
dada
dadabe
dadabenareo
dadabenay
dadabenoely
dadabeny
dadafara
dadafaran'i
dadah
dadako
dadamanana
dadan
dadan'i
dadanao
dadanay
dadany
dadatoan'i
dadatoan'izy
dadatoany
daferana
dafy
dahalo
daharaham
daharana
dahatra
dahlias
daholo
daholobe
dahy
daigner
dainga
daka
dakan
dakao
dakilasy
dakira
dakolosy
dakozia
dalambe
dalamben'ilay
dalambenao
dalambenay
dalamby
dalan
dalana
dalanodiaviko
dalantsara
dalao
dalatsara
daleta
dalfona
dalin'andriamanitra
dalin'i
dalina
dalitra
dalmatia
dalàna
dam
dama
damary
damasikosy
damaskosin'i
damaskosy
damba
dames
damima
damosiko
damosin'ilay
damosin'ny
damosina
damosinao
damosiny
damy
dana
daniel
daniela
danielle
danielson
danin'ny
danita
danitra
danja
danny
dano
dansait
danse
dansent
danser
danses
danstesyeux
dantony
daona
daoranjy
dapa
dapako
dapan'i
dapan'ny
dapanao
dapany
dar
dara
daravarana
darda
dark
darkness
darknest
darofana
daroka
dasa
dasely
dason
dasopy
dasy
databany
databatr'i
databatra
databatrao
databatro
databatry
datin'andro
datsa
daty
dava
davaka
davaky
davanandro
davany
davarangana
davenona
davitra
davy
day
dcsid
dear
debara
decent
decim
dedana
defon'i
defona
deha
dehibe
dehilahy
dela
delegasiaona
delegasiona
delegasionin'ny
delegasionina
delege
delegen
delor
demande
demasy
demeure
demoiselles
demonia
denaria
denis
denisse
deoteronomia
depardieu
depth
depuis
dera
deraiko
derain'i
derain'ny
deraina
derainay
derantsoa
derao
derbe
deric
desire
despair
dessous
det
deux
devais
devant
deviendront
devient
devine
devise
devizy
devoly
dgae
dgi
dia
diabe
diadema
diako
diam
diamanga
diamondra
dian
dian'ny
dian'ondry
diana
dianao
dianareo
dianay
diantsika
diany
diaviano
diavin
diavina
diavinao
diavola
diavolan
diavolana
dibera
diblataima
diboky
dibona
dick
didi
didididiana
didiko
didim
didin'andriamanitra
didin'andriamanitro
didin'andriamanitsika
didin'i
didin'ilay
didin'ny
didin'olombelona
didinao
didiny
didn
didy
die
diego
dieny
dies
difitra
difo
difotra
difotry
dify
digitale
dignin
dignity
dihin'ny
dihy
dika
dikaina
dikan'ilay
dikan'io
dikan'ireny
dikan'ireo
dikan'izany
dikan'izao
dikan'izay
dikan'ny
dikany
dikin'olona
dikla
diky
dila
dilana
dimampolo
dimampolony
dimanjato
dimbaka
dimbiasan
dimbiasana
dimbiniaina
dimbiny
dimbisoa
dimby
dimna
dimy
dina
dinaba
dinan'ny
dinantsika
dinety
dingam
dingan
dingana
dinganina
dinidinihana
dinidinika
dinidinintsika
dinidy
dinihiko
dinihin'i
dinihin'ilay
dinihin'ny
dinihina
dinihinay
dinihiny
diniho
dinika
dinta
diona
diovina
diovinao
diovy
diplaoma
diplaomatika
diplomatika
dirais
dire
direkitera
dis
disadisa
disana
dise
diso
disoina
dison'i
dison'ireo
disona
dispose
disque
distanced
distractions
distrika
distrikan
dit
ditin
ditin'ny
ditiny
ditra
ditraditra
ditran'izay
ditran'ny
ditranao
ditrany
ditrin
ditry
ditsoka
divaiko
divain'andriamanitra
divain'i
divain'ny
divainao
divainy
divay
dizahaba
djadagna
djiady
djistera
dobo
dobodobok
dobohy
dobok
dobok'aponga
doboka
doboky
dobon'i
dobon'ny
dodanima
dodo
dodona
dodue
doha
dohako
doham
dohan
dohan'i
dohan'ilay
dohan'ireo
dohan'izay
dohan'izy
dohan'ny
dohanao
dohanareo
dohanay
dohany
doharano
dohasaha
dohataona
dokadoka
dokanga
doko
dokotera
doktoraly
doladolanao
dolara
doll
doma
domaniale
dombo
domohina
domohinanao
domy
don
dona
donak
dond
dondona
dondrona
donga
dongadonga
dongidongiko
dongidongy
dongodongona
dongom
dongon
dongontany
donnie
dons
donto
dopka
dora
doran
dorana
dorany
dorehitra
dorette
doria
doris
dorkasy
doroky
dory
dos
dotana
douce
douces
doux
dovia
dovian
down
doza
dpit
dpse
dqe
dra
dradradradraina
dradradradrao
dradraina
drae
drafahafatesana
drafahalalana
drafanja
drafanjamalala
drafitr'ilay
drafitra
dragnoko
dragona
drahaba
drahalahin'i
drahalahiny
drahalahy
draharaha
draharaham
draharahan
draharahan'ny
drahona
draiko
drain'i
drain'izany
drainao
drainay
drainivoanjo
drainy
drakalakely
drakma
drakotra
drala
dralaitelofera
dralavatandroka
dralehilahy
dramalagasy
dramanandraibe
dramanga
dramatoa
drambo
drameva
drangolahy
dranjo
drano
dranomaintin'ny
dranomanitra
dranomasina
dranomaso
dranomena
dranon
dranon'ando
dranon'i
dranon'ny
dranona
dranonorana
dranony
draozy
drariny
draromaso
drasazy
dratovovavy
dratsin'izany
dratsin'ny
dratsinareo
dratsiny
dratsy
dravaviantitra
dravehivavy
dravina
dray
drazako
drazana
drazananivo
drazanao
drazanareo
drazantsika
drazany
drazazavavy
drd
dream
dreamed
dreaming
dreams
drefy
drehareha
drehetra
drehetran'ilehiny
drema
drendrarendra
drendrika
dreniko
drenin'i
drenin'ialahy
drenin'ilay
dreninao
dreninareo
dreniny
drenivohitra
dreny
drery
dresak'ireo
dresaka
dresaky
dresena
dresy
driaka
driakan'i
dridrangilo
drijantenin
drindrangilo
drindrina
drivotra
drnm
droa
drodroka
drodroky
droha
drojo
drojon'ny
dromoromo
drongony
dronono
drora
drouot
drova
dry
dsi
dti
dtvm
ducret
dumb
duo
dure
dures
duval
dva
dying
dàlana
e
each
eaie
ebala
ebenezera
eboebo
ebrona
ecoles
ect
eddy
eden
edena
edera
edgvm
edmond
ednes
edoma
edomita
edouard
edrehy
edt
eee
eeee
eeeee
eeeeee
eeeeeeee
eeeeh
eeh
efa
efaha
efainao
efajato
efajoro
efako
efalao
efalasanao
efamira
efampaka
efanao
efao
efapolo
efata
efatr'ilay
efatra
efatry
efera
efesa
efesianina
efesosy
effet
effigie
efitr'i
efitr'ireo
efitra
efitrano
efitranoko
efitranon'ilay
efitranon'ny
efitranonao
efitranonareo
efitranony
efitrefitra
efitry
efoda
efraimita
efraina
efrata
efratita
eglaima
egleta
eglizy
egna
ehy
eia
eiae
eiffeil
eiti
eja
ejipsianina
ejipta
eka
ekbatana
ekeko
eken
eken'andriamanitra
eken'i
ekena
ekenao
ekenareo
ekentsika
ekeny
ekeo
ekera
ekipa
ekipam
ekipanay
ekolazy
ekonomika
ekrona
ekronita
eksodosy
ela
elabe
elaela
elakelan
elale
elama
elamita
elanana
elanelan
elanelan'ireo
elanelana
elanelanin'ny
elanelany
elantany
elany
elata
elatr
elatr'ilay
elatr'ireo
elatr'izy
elatra
elatrao
elatry
eldada
eldaha
eleazara
electricy
elefa
elia
eliaba
eliada
eliama
eliasy
eliata
elidada
elie
eliela
elienay
elifala
elifazara
elifeleho
elifeleta
elihoda
elihorefa
elika
elima
elipeleta
elis
elisa
elisabeth
elisafata
elisoa
elizafana
elkana
elkosita
elle
elles
elmadama
elnatana
elo
elohina
elola
elomanga
elonao
elonita
elozay
elteke
eltekona
eltolada
ely
elzabada
emaosy
emboka
embona
embonembona
embrassent
embrasser
emeka
emeraoda
emilda
emile
emilio
emima
emirats
emmener
emportant
emprises
en
ena
enaima
enam
enama
enao
enay
enchante
enchantent
encombrent
encore
end
endahanareo
endahina
endaho
endless
endrey
endrik
endrik'andriamanitra
endrik'i
endrik'ilay
endrik'ireo
endrik'izy
endrik'olon
endrika
endrikao
endrikendrehin'ny
endrikendrehina
endrikendrika
endriky
endrin
endriny
endry
enea
enfant
enga
enim
enimbolany
enimpolo
enin
enina
eninjato
enintsoa
enivre
enjana
enjankenjana
enjehany
enjehin
enjehin'izany
enjehin'izy
enjehin'ny
enjehina
enjehinao
enjehinareo
enjehiny
enjeho
enjika
enjikenjika
enlacent
enmg
ennui
ennuie
ennuis
ennuyeux
ensemble
ensp
enta
entako
entam
entan
entan'ny
entana
entanao
entanareo
entano
entantsika
entany
entendez
entends
enti
entiko
entim
entin
entin'andriamanitra
entin'i
entin'izy
entin'ny
entina
entinao
entinareo
entinay
entiny
entitsika
ento
entrain
entrepreneurs
entretenus
entsaky
envie
envola
envolent
envoyez
eny
eo
eonika
eorakylona
eotyka
epikoreanina
er
era
eram
eran
eran'i
eran'ilay
eran'izao
eran'ny
eranita
ereka
eric
erick
erik
erika
erikerika
erita
eritreretiko
eritreretin
eritreretin'izy
eritreretin'ny
eritreretina
eritreretinao
eritreretinareo
eritreretintsika
eritreretiny
eritrereto
eritreri
eritrerintsika
eritreriny
eritreritr'izy
eritreritra
eritreritrao
eritreritrareo
eritreritray
eritreritro
eritreritry
ernaivo
ernest
eroa
eropeanina
erotrerony
ery
esana
esbala
esbana
eseka
esly
eso
esoeso
esoesoin'izy
esoesoina
esoesoiny
esoeson'izy
esoeson'ny
esoin'izy
esoina
eson
esoriko
esorin'andriamanitra
esorin'i
esorina
esorinao
esorinareo
esoriny
esory
esos
espace
espaina
espana
espoir
esprit
essa
est
estaola
estaolita
estemo
estemoa
estimatifs
et
eta
etam
etama
etamazaoro
etamazaoron
etanima
etc
etera
etheve
etienne
etiopianina
etnana
eto
etoana
etona
etsetra
etsy
ety
eurent
europe
eux
eva
even
ever
everyone
everything
evokevo
evrard
ewa
excitant
excrucing
expliquer
eyah
eyes
ezahany
ezahiko
ezaho
ezaka
ezbona
ezera
ezerita
eziona
ezra
ezrahita
f'ao
f'aza
f'efa
f'eto
f'hianarana
f'hisy
f'ho
f'ianao
f'ilaina
f'ilay
f'indray
f'indry
f'inona
f'izaho
f'izao
f'izay
f'izy
f'olom
f'omeko
f'zaho
fa
fabien
fabio
fabiola
faboriana
fad
fadimbolana
fadimbolany
fadin
fadio
fadiranovana
fady
fafafafao
fafah
fafana
fafanay
fafao
fafazan
fafazana
fafazo
fafinaretana
fafàna
fagnahy
faguet
faha
fahabanganao
fahabangany
fahadalana
fahadimampolo
fahadimin'ny
fahadimy
fahadiovako
fahadiovan'ny
fahadiovana
fahadisoako
fahadisoam
fahadisoan'i
fahadisoan'ilay
fahadisoan'io
fahadisoan'ireo
fahadisoan'izy
fahadisoan'ny
fahadisoana
fahadisoanao
fahadisoanareo
fahadisoanay
fahadisoantsika
fahadisoany
fahafahako
fahafaham
fahafahana
fahafahanao
fahafahanareo
fahafahany
fahafatesan'iny
fahafatesan'io
fahafatesan'ireo
fahafatesan'izy
fahafatesan'ny
fahafatesana
fahafatesanao
fahafatesanareo
fahafatesany
fahafinaretako
fahafinaretan'ny
fahafinaretana
fahafirin'ny
fahafiry
fahafito
fahafiton'ny
fahafoizan
fahafoizanareo
fahafolo
fahafolon'io
fahafolon'ny
fahagagana
fahagola
fahaiza
fahaizan'i
fahaizana
fahaizanao
fahaizany
fahakeliny
fahal
fahalalako
fahalalan'izy
fahalalana
fahalalanao
fahalalanareo
fahalalantsika
fahalalany
fahalalàna
fahalavoan'ny
fahalehibeazan'ny
fahalehibeazana
fahalehibeazanao
fahalehibeazany
fahalemeko
fahalemem
fahalemen
fahalemen'izay
fahalemen'ny
fahalemena
fahalementsika
fahalemeny
fahaleovan
fahalotoan'izao
fahalotoan'ny
fahalotoan'olona
fahalotoana
fahalotoanao
fahalotoanareo
fahalotoany
fahamalinana
fahamarinako
fahamarinan
fahamarinan'andriamanitra
fahamarinan'i
fahamarinan'ny
fahamarinana
fahamarinanao
fahamarinanareo
fahamarinantsika
fahamarinany
fahamasahan'ny
fahamasinan'i
fahamasinana
fahamatorana
fahamoizana
fahampiana
fahan
fahana
fahanako
fahanginana
fahanginanao
fahano
fahanterana
fahanterany
fahantran'ny
fahantrana
fahantranao
fahantrany
fahany
faharariana
faharatsian'i
faharatsian'izy
faharatsian'ny
faharatsiana
faharatsianao
faharatsiany
faharatsiny
faharavana
fahareseko
faharesena
fahareseny
faharetako
faharetan'ny
faharetana
faharetanao
faharivo
faharoa
faharoan'i
faharoan'ny
faharoapolo
fahasahian'i
fahasahiana
fahasahirana
fahasahiranana
fahasahirananao
fahasalam
fahasalamako
fahasalamam
fahasalaman
fahasalaman'izy
fahasalaman'ny
fahasalamana
fahasalamanao
fahasalamany
fahasambarako
fahasambarana
fahasambaranao
fahasamihafan'ny
fahasarontam
fahasarotam
fahasimbana
fahasivin'ny
fahasivy
fahasoavan'ny
fahasoavana
fahasoavanao
fahasosorana
fahatahorako
fahatahorana
fahatahorany
fahatanorana
fahatanoranao
fahatanoranareo
fahatanorany
fahatanterahan'ilay
fahatanterahan'izany
fahatanterahan'ny
fahatany
fahataperana
fahatarana
fahatelo
fahatelon'ny
fahaterahana
fahatezerako
fahatezeran
fahatezeran'andriamanitra
fahatezeran'i
fahatezeran'ilay
fahatezeran'ny
fahatezerana
fahatezeranao
fahatezeranareo
fahatezerany
fahatezerena
fahatokisan
fahatongavan'ny
fahatongavany
fahatoniana
fahatsarana
fahatsaràny
fahatsiarovako
fahatsiarovana
fahatsiarovanao
fahatsiarovko
fahatsoram
fahatsorana
fahatsoranao
fahavalo
fahavaloko
fahavalon
fahavalon'andriamanitra
fahavalon'i
fahavalon'ilay
fahavalon'izay
fahavalon'izy
fahavalon'ny
fahavalonao
fahavalonareo
fahavalonay
fahavalontsika
fahavalony
fahavalopolo
fahavaratra
fahavaratray
fahavatra
fahavelomana
fahavelon'ilay
fahavelona
fahavelony
fahaverezana
fahavinirako
fahavinirana
fahaviniranao
fahavinirany
fahavitsian
fahavoazako
fahavoazan'ireo
fahavoazan'izy
fahavoazan'ny
fahavoazana
fahavoazanao
fahavoazany
fahavononan
fahavononan'ny
fahavononana
fahavononanareo
fahavononany
fahazakako
fahazarana
fahazarandratsy
fahazavako
fahazavan'izao
fahazavan'ny
fahazavana
fahazavanao
fahazavany
fahazaza
fahazazako
fahazazana
fahazazanao
fahazazanay
fahazazany
fahazoan
fahazoana
fahazoanao
fahazotoan'ny
fahazotoana
fahefako
fahefan
fahefan'andriamanitra
fahefan'i
fahefan'ilay
fahefan'ireo
fahefan'ny
fahefan'olona
fahefana
fahefanao
fahefanay
fahefany
fahefapolo
fahefatra
fahefatry
fahendreko
fahendren
fahendren'andriamanitra
fahendren'i
fahendren'izao
fahendren'ny
fahendren'olombelona
fahendrena
fahendrenao
fahendreny
fahenina
fahenoako
fahenoana
fahiny
fahiraika
fahirano
fahiratan
fahita
fahitako
fahitalavitra
fahitan'i
fahitan'izy
fahitana
fahitanareo
fahitanay
fahitany
fahitsian'ny
fahitsiana
fahizay
fahombiazan
fahombiazana
fahombiazany
fahoriako
fahoriam
fahorian
fahorian'i
fahorian'izy
fahorian'ny
fahoriana
fahorianao
fahorianay
fahoriany
fahosana
fahotako
fahotan
fahotan'i
fahotan'ilay
fahotan'ireo
fahotan'izao
fahotan'izy
fahotan'ny
fahotana
fahotanao
fahotanareo
fahotanay
fahotantsika
fahotany
faikan'ny
faikany
faim
faingam
faingana
fainganana
faingàna
faire
fais
faisait
faisana
fait
faithfully
faits
faiziko
faizin
faizin'i
faizin'ny
faizina
faizinao
faiziny
faizo
faka
fakako
fakam
fakampanahy
fakan
fakan'anjavidy
fakan'i
fakan'ilay
fakan'izy
fakan'ny
fakana
fakanao
fakany
fakitera
fakiteranay
fako
fakofakony
fakon'izao
fala
faladia
faladiako
faladian'izy
faladian'ny
faladianao
faladianareo
faladiany
falafa
falehako
falehan
falehan'ny
falehany
falifaly
falinirina
falitiana
faly
famadihan
famadihana
famafa
famafana
famafazam
famahana
famahanana
famaharana
famaharinana
famahàna
famaizan'i
famaizan'ilay
famaizana
famaky
famalian'i
famalian'ilay
famaliana
famalinao
famandriham
famandrihana
famandrihany
famangana
famangiana
famantaran
famantarana
